Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x2fd (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 12 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0xdd5df): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x1f57d): D:/Projeto-WR/Rastreador_WR/Core/Src/freertos.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0xa3403): D:/Projeto-WR/Rastreador_WR/STM32CubeIDE/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 13 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 5	(signed)
    <2d>   DW_AT_name        : int
 <1><31>: Abbrev Number: 1 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 4
    <33>   DW_AT_encoding    : 7	(unsigned)
    <34>   DW_AT_name        : (indirect string, offset: 0x123d8): unsigned int
 <1><38>: Abbrev Number: 1 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 8
    <3a>   DW_AT_encoding    : 5	(signed)
    <3b>   DW_AT_name        : (indirect string, offset: 0x666fa): long long int
 <1><3f>: Abbrev Number: 1 (DW_TAG_base_type)
    <40>   DW_AT_byte_size   : 8
    <41>   DW_AT_encoding    : 4	(float)
    <42>   DW_AT_name        : (indirect string, offset: 0xe946a): long double
 <1><46>: Abbrev Number: 1 (DW_TAG_base_type)
    <47>   DW_AT_byte_size   : 1
    <48>   DW_AT_encoding    : 6	(signed char)
    <49>   DW_AT_name        : (indirect string, offset: 0x71a3e): signed char
 <1><4d>: Abbrev Number: 3 (DW_TAG_typedef)
    <4e>   DW_AT_name        : (indirect string, offset: 0x41568): __uint8_t
    <52>   DW_AT_decl_file   : 2
    <53>   DW_AT_decl_line   : 43
    <54>   DW_AT_decl_column : 24
    <55>   DW_AT_type        : <0x59>
 <1><59>: Abbrev Number: 1 (DW_TAG_base_type)
    <5a>   DW_AT_byte_size   : 1
    <5b>   DW_AT_encoding    : 8	(unsigned char)
    <5c>   DW_AT_name        : (indirect string, offset: 0xd95a4): unsigned char
 <1><60>: Abbrev Number: 1 (DW_TAG_base_type)
    <61>   DW_AT_byte_size   : 2
    <62>   DW_AT_encoding    : 5	(signed)
    <63>   DW_AT_name        : (indirect string, offset: 0xa6ff7): short int
 <1><67>: Abbrev Number: 3 (DW_TAG_typedef)
    <68>   DW_AT_name        : (indirect string, offset: 0xb7c7e): __uint16_t
    <6c>   DW_AT_decl_file   : 2
    <6d>   DW_AT_decl_line   : 57
    <6e>   DW_AT_decl_column : 25
    <6f>   DW_AT_type        : <0x73>
 <1><73>: Abbrev Number: 1 (DW_TAG_base_type)
    <74>   DW_AT_byte_size   : 2
    <75>   DW_AT_encoding    : 7	(unsigned)
    <76>   DW_AT_name        : (indirect string, offset: 0xd7cca): short unsigned int
 <1><7a>: Abbrev Number: 1 (DW_TAG_base_type)
    <7b>   DW_AT_byte_size   : 4
    <7c>   DW_AT_encoding    : 5	(signed)
    <7d>   DW_AT_name        : (indirect string, offset: 0x12e56): long int
 <1><81>: Abbrev Number: 3 (DW_TAG_typedef)
    <82>   DW_AT_name        : (indirect string, offset: 0x8f8a3): __uint32_t
    <86>   DW_AT_decl_file   : 2
    <87>   DW_AT_decl_line   : 79
    <88>   DW_AT_decl_column : 25
    <89>   DW_AT_type        : <0x8d>
 <1><8d>: Abbrev Number: 1 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0x557a7): long unsigned int
 <1><94>: Abbrev Number: 1 (DW_TAG_base_type)
    <95>   DW_AT_byte_size   : 8
    <96>   DW_AT_encoding    : 7	(unsigned)
    <97>   DW_AT_name        : (indirect string, offset: 0x2ea30): long long unsigned int
 <1><9b>: Abbrev Number: 3 (DW_TAG_typedef)
    <9c>   DW_AT_name        : (indirect string, offset: 0x4156a): uint8_t
    <a0>   DW_AT_decl_file   : 3
    <a1>   DW_AT_decl_line   : 24
    <a2>   DW_AT_decl_column : 19
    <a3>   DW_AT_type        : <0x4d>
 <1><a7>: Abbrev Number: 8 (DW_TAG_const_type)
    <a8>   DW_AT_type        : <0x9b>
 <1><ac>: Abbrev Number: 3 (DW_TAG_typedef)
    <ad>   DW_AT_name        : (indirect string, offset: 0xa3d58): uint16_t
    <b1>   DW_AT_decl_file   : 3
    <b2>   DW_AT_decl_line   : 36
    <b3>   DW_AT_decl_column : 20
    <b4>   DW_AT_type        : <0x67>
 <1><b8>: Abbrev Number: 3 (DW_TAG_typedef)
    <b9>   DW_AT_name        : (indirect string, offset: 0xa31e3): uint32_t
    <bd>   DW_AT_decl_file   : 3
    <be>   DW_AT_decl_line   : 48
    <bf>   DW_AT_decl_column : 20
    <c0>   DW_AT_type        : <0x81>
 <1><c4>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <c5>   DW_AT_byte_size   : 4
 <1><c6>: Abbrev Number: 3 (DW_TAG_typedef)
    <c7>   DW_AT_name        : (indirect string, offset: 0xa428c): StackType_t
    <cb>   DW_AT_decl_file   : 4
    <cc>   DW_AT_decl_line   : 55
    <cd>   DW_AT_decl_column : 24
    <ce>   DW_AT_type        : <0xb8>
 <1><d2>: Abbrev Number: 3 (DW_TAG_typedef)
    <d3>   DW_AT_name        : (indirect string, offset: 0x1748): UBaseType_t
    <d7>   DW_AT_decl_file   : 4
    <d8>   DW_AT_decl_line   : 57
    <d9>   DW_AT_decl_column : 23
    <da>   DW_AT_type        : <0x8d>
 <1><de>: Abbrev Number: 3 (DW_TAG_typedef)
    <df>   DW_AT_name        : (indirect string, offset: 0x7c2a6): TickType_t
    <e3>   DW_AT_decl_file   : 4
    <e4>   DW_AT_decl_line   : 63
    <e5>   DW_AT_decl_column : 19
    <e6>   DW_AT_type        : <0xb8>
 <1><ea>: Abbrev Number: 8 (DW_TAG_const_type)
    <eb>   DW_AT_type        : <0xde>
 <1><ef>: Abbrev Number: 10 (DW_TAG_structure_type)
    <f0>   DW_AT_name        : (indirect string, offset: 0xbc23e): xSTATIC_LIST_ITEM
    <f4>   DW_AT_byte_size   : 20
    <f5>   DW_AT_decl_file   : 5
    <f5>   DW_AT_decl_line   : 1061
    <f7>   DW_AT_decl_column : 8
    <f8>   DW_AT_sibling     : <0x117>
 <2><fc>: Abbrev Number: 2 (DW_TAG_member)
    <fd>   DW_AT_name        : (indirect string, offset: 0xe6ad7): xDummy2
    <101>   DW_AT_decl_file   : 5
    <101>   DW_AT_decl_line   : 1066
    <103>   DW_AT_decl_column : 13
    <104>   DW_AT_type        : <0xde>
    <108>   DW_AT_data_member_location: 0
 <2><109>: Abbrev Number: 2 (DW_TAG_member)
    <10a>   DW_AT_name        : (indirect string, offset: 0x50d43): pvDummy3
    <10e>   DW_AT_decl_file   : 5
    <10e>   DW_AT_decl_line   : 1067
    <110>   DW_AT_decl_column : 8
    <111>   DW_AT_type        : <0x117>
    <115>   DW_AT_data_member_location: 4
 <2><116>: Abbrev Number: 0
 <1><117>: Abbrev Number: 4 (DW_TAG_array_type)
    <118>   DW_AT_type        : <0xc4>
    <11c>   DW_AT_sibling     : <0x127>
 <2><120>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <121>   DW_AT_type        : <0x31>
    <125>   DW_AT_upper_bound : 3
 <2><126>: Abbrev Number: 0
 <1><127>: Abbrev Number: 11 (DW_TAG_typedef)
    <128>   DW_AT_name        : (indirect string, offset: 0xa98f2): StaticListItem_t
    <12c>   DW_AT_decl_file   : 5
    <12c>   DW_AT_decl_line   : 1072
    <12e>   DW_AT_decl_column : 34
    <12f>   DW_AT_type        : <0xef>
 <1><133>: Abbrev Number: 10 (DW_TAG_structure_type)
    <134>   DW_AT_name        : (indirect string, offset: 0x6a7c3): xSTATIC_TCB
    <138>   DW_AT_byte_size   : 84
    <139>   DW_AT_decl_file   : 5
    <139>   DW_AT_decl_line   : 1112
    <13b>   DW_AT_decl_column : 16
    <13c>   DW_AT_sibling     : <0x1b6>
 <2><140>: Abbrev Number: 2 (DW_TAG_member)
    <141>   DW_AT_name        : (indirect string, offset: 0x2daca): pxDummy1
    <145>   DW_AT_decl_file   : 5
    <145>   DW_AT_decl_line   : 1114
    <147>   DW_AT_decl_column : 11
    <148>   DW_AT_type        : <0xc4>
    <14c>   DW_AT_data_member_location: 0
 <2><14d>: Abbrev Number: 2 (DW_TAG_member)
    <14e>   DW_AT_name        : (indirect string, offset: 0x2ab37): xDummy3
    <152>   DW_AT_decl_file   : 5
    <152>   DW_AT_decl_line   : 1118
    <154>   DW_AT_decl_column : 19
    <155>   DW_AT_type        : <0x1b6>
    <159>   DW_AT_data_member_location: 4
 <2><15a>: Abbrev Number: 2 (DW_TAG_member)
    <15b>   DW_AT_name        : (indirect string, offset: 0x1ef1d): uxDummy5
    <15f>   DW_AT_decl_file   : 5
    <15f>   DW_AT_decl_line   : 1119
    <161>   DW_AT_decl_column : 16
    <162>   DW_AT_type        : <0xd2>
    <166>   DW_AT_data_member_location: 44
 <2><167>: Abbrev Number: 2 (DW_TAG_member)
    <168>   DW_AT_name        : (indirect string, offset: 0x2db83): pxDummy6
    <16c>   DW_AT_decl_file   : 5
    <16c>   DW_AT_decl_line   : 1120
    <16e>   DW_AT_decl_column : 11
    <16f>   DW_AT_type        : <0xc4>
    <173>   DW_AT_data_member_location: 48
 <2><174>: Abbrev Number: 2 (DW_TAG_member)
    <175>   DW_AT_name        : (indirect string, offset: 0x4f1a4): ucDummy7
    <179>   DW_AT_decl_file   : 5
    <179>   DW_AT_decl_line   : 1121
    <17b>   DW_AT_decl_column : 13
    <17c>   DW_AT_type        : <0x1c6>
    <180>   DW_AT_data_member_location: 52
 <2><181>: Abbrev Number: 2 (DW_TAG_member)
    <182>   DW_AT_name        : (indirect string, offset: 0x316a4): uxDummy12
    <186>   DW_AT_decl_file   : 5
    <186>   DW_AT_decl_line   : 1132
    <188>   DW_AT_decl_column : 16
    <189>   DW_AT_type        : <0x1d6>
    <18d>   DW_AT_data_member_location: 68
 <2><18e>: Abbrev Number: 2 (DW_TAG_member)
    <18f>   DW_AT_name        : (indirect string, offset: 0x20588): ulDummy18
    <193>   DW_AT_decl_file   : 5
    <193>   DW_AT_decl_line   : 1147
    <195>   DW_AT_decl_column : 14
    <196>   DW_AT_type        : <0xb8>
    <19a>   DW_AT_data_member_location: 76
 <2><19b>: Abbrev Number: 2 (DW_TAG_member)
    <19c>   DW_AT_name        : (indirect string, offset: 0x4468f): ucDummy19
    <1a0>   DW_AT_decl_file   : 5
    <1a0>   DW_AT_decl_line   : 1148
    <1a2>   DW_AT_decl_column : 13
    <1a3>   DW_AT_type        : <0x9b>
    <1a7>   DW_AT_data_member_location: 80
 <2><1a8>: Abbrev Number: 2 (DW_TAG_member)
    <1a9>   DW_AT_name        : (indirect string, offset: 0xcb70a): uxDummy20
    <1ad>   DW_AT_decl_file   : 5
    <1ad>   DW_AT_decl_line   : 1151
    <1af>   DW_AT_decl_column : 13
    <1b0>   DW_AT_type        : <0x9b>
    <1b4>   DW_AT_data_member_location: 81
 <2><1b5>: Abbrev Number: 0
 <1><1b6>: Abbrev Number: 4 (DW_TAG_array_type)
    <1b7>   DW_AT_type        : <0x127>
    <1bb>   DW_AT_sibling     : <0x1c6>
 <2><1bf>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <1c0>   DW_AT_type        : <0x31>
    <1c4>   DW_AT_upper_bound : 1
 <2><1c5>: Abbrev Number: 0
 <1><1c6>: Abbrev Number: 4 (DW_TAG_array_type)
    <1c7>   DW_AT_type        : <0x9b>
    <1cb>   DW_AT_sibling     : <0x1d6>
 <2><1cf>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <1d0>   DW_AT_type        : <0x31>
    <1d4>   DW_AT_upper_bound : 15
 <2><1d5>: Abbrev Number: 0
 <1><1d6>: Abbrev Number: 4 (DW_TAG_array_type)
    <1d7>   DW_AT_type        : <0xd2>
    <1db>   DW_AT_sibling     : <0x1e6>
 <2><1df>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <1e0>   DW_AT_type        : <0x31>
    <1e4>   DW_AT_upper_bound : 1
 <2><1e5>: Abbrev Number: 0
 <1><1e6>: Abbrev Number: 11 (DW_TAG_typedef)
    <1e7>   DW_AT_name        : (indirect string, offset: 0x6fe28): StaticTask_t
    <1eb>   DW_AT_decl_file   : 5
    <1eb>   DW_AT_decl_line   : 1160
    <1ed>   DW_AT_decl_column : 3
    <1ee>   DW_AT_type        : <0x133>
 <1><1f2>: Abbrev Number: 1 (DW_TAG_base_type)
    <1f3>   DW_AT_byte_size   : 1
    <1f4>   DW_AT_encoding    : 8	(unsigned char)
    <1f5>   DW_AT_name        : (indirect string, offset: 0x4877f): char
 <1><1f9>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <1fa>   DW_AT_byte_size   : 4
    <1fa>   DW_AT_type        : <0xc6>
 <1><1fe>: Abbrev Number: 4 (DW_TAG_array_type)
    <1ff>   DW_AT_type        : <0xa7>
    <203>   DW_AT_sibling     : <0x20e>
 <2><207>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <208>   DW_AT_type        : <0x31>
    <20c>   DW_AT_upper_bound : 6
 <2><20d>: Abbrev Number: 0
 <1><20e>: Abbrev Number: 8 (DW_TAG_const_type)
    <20f>   DW_AT_type        : <0x1fe>
 <1><213>: Abbrev Number: 9 (DW_TAG_variable)
    <214>   DW_AT_name        : (indirect string, offset: 0x2c15d): CHANNEL_OFFSET_TAB
    <218>   DW_AT_decl_file   : 6
    <219>   DW_AT_decl_line   : 49
    <21a>   DW_AT_decl_column : 22
    <21b>   DW_AT_type        : <0x20e>
    <21f>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><225>: Abbrev Number: 9 (DW_TAG_variable)
    <226>   DW_AT_name        : (indirect string, offset: 0x776fd): xIdleTaskTCBBuffer
    <22a>   DW_AT_decl_file   : 1
    <22b>   DW_AT_decl_line   : 59
    <22c>   DW_AT_decl_column : 21
    <22d>   DW_AT_type        : <0x1e6>
    <231>   DW_AT_location    : 5 byte block: 3 2c 0 0 20 	(DW_OP_addr: 2000002c)
 <1><237>: Abbrev Number: 4 (DW_TAG_array_type)
    <238>   DW_AT_type        : <0xc6>
    <23c>   DW_AT_sibling     : <0x247>
 <2><240>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <241>   DW_AT_type        : <0x31>
    <245>   DW_AT_upper_bound : 127
 <2><246>: Abbrev Number: 0
 <1><247>: Abbrev Number: 9 (DW_TAG_variable)
    <248>   DW_AT_name        : (indirect string, offset: 0x43e2c): xIdleStack
    <24c>   DW_AT_decl_file   : 1
    <24d>   DW_AT_decl_line   : 60
    <24e>   DW_AT_decl_column : 20
    <24f>   DW_AT_type        : <0x237>
    <253>   DW_AT_location    : 5 byte block: 3 80 0 0 20 	(DW_OP_addr: 20000080)
 <1><259>: Abbrev Number: 15 (DW_TAG_subprogram)
    <25a>   DW_AT_external    : 1
    <25a>   DW_AT_name        : (indirect string, offset: 0x2c5d2): app_principal_iniciar
    <25e>   DW_AT_decl_file   : 7
    <25f>   DW_AT_decl_line   : 10
    <260>   DW_AT_decl_column : 6
    <261>   DW_AT_prototyped  : 1
    <261>   DW_AT_declaration : 1
 <1><261>: Abbrev Number: 16 (DW_TAG_subprogram)
    <262>   DW_AT_external    : 1
    <262>   DW_AT_name        : (indirect string, offset: 0x84f0b): vTaskDelay
    <266>   DW_AT_decl_file   : 8
    <267>   DW_AT_decl_line   : 758
    <269>   DW_AT_decl_column : 6
    <26a>   DW_AT_prototyped  : 1
    <26a>   DW_AT_declaration : 1
    <26a>   DW_AT_sibling     : <0x274>
 <2><26e>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <26f>   DW_AT_type        : <0xea>
 <2><273>: Abbrev Number: 0
 <1><274>: Abbrev Number: 18 (DW_TAG_subprogram)
    <275>   DW_AT_external    : 1
    <275>   DW_AT_name        : (indirect string, offset: 0xb4f40): MX_FREERTOS_Init
    <279>   DW_AT_decl_file   : 1
    <27a>   DW_AT_decl_line   : 86
    <27b>   DW_AT_decl_column : 6
    <27c>   DW_AT_prototyped  : 1
    <27c>   DW_AT_low_pc      : 0x8000204
    <280>   DW_AT_high_pc     : 0xc
    <284>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <286>   DW_AT_call_all_tail_calls: 1
 <1><286>: Abbrev Number: 19 (DW_TAG_subprogram)
    <287>   DW_AT_name        : (indirect string, offset: 0x996e8): tarefa_principal
    <28b>   DW_AT_decl_file   : 1
    <28c>   DW_AT_decl_line   : 78
    <28d>   DW_AT_decl_column : 13
    <28e>   DW_AT_prototyped  : 1
    <28e>   DW_AT_low_pc      : 0
    <292>   DW_AT_high_pc     : 0x12
    <296>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <298>   DW_AT_call_all_tail_calls: 1
    <298>   DW_AT_sibling     : <0x2ab>
 <2><29c>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <29d>   DW_AT_name        : (indirect string, offset: 0x3b001): argumentos
    <2a1>   DW_AT_decl_file   : 1
    <2a1>   DW_AT_decl_line   : 78
    <2a2>   DW_AT_decl_column : 36
    <2a3>   DW_AT_type        : <0xc4>
    <2a7>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><2aa>: Abbrev Number: 0
 <1><2ab>: Abbrev Number: 20 (DW_TAG_subprogram)
    <2ac>   DW_AT_external    : 1
    <2ac>   DW_AT_name        : (indirect string, offset: 0xa10e4): vApplicationGetIdleTaskMemory
    <2b0>   DW_AT_decl_file   : 1
    <2b1>   DW_AT_decl_line   : 62
    <2b2>   DW_AT_decl_column : 6
    <2b3>   DW_AT_prototyped  : 1
    <2b3>   DW_AT_low_pc      : 0x80001d0
    <2b7>   DW_AT_high_pc     : 0x34
    <2bb>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <2bd>   DW_AT_call_all_calls: 1
    <2bd>   DW_AT_sibling     : <0x2ec>
 <2><2c1>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <2c2>   DW_AT_name        : (indirect string, offset: 0x776fb): ppxIdleTaskTCBBuffer
    <2c6>   DW_AT_decl_file   : 1
    <2c6>   DW_AT_decl_line   : 62
    <2c7>   DW_AT_decl_column : 52
    <2c8>   DW_AT_type        : <0x2ec>
    <2cc>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><2cf>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <2d0>   DW_AT_name        : (indirect string, offset: 0x8287f): ppxIdleTaskStackBuffer
    <2d4>   DW_AT_decl_file   : 1
    <2d4>   DW_AT_decl_line   : 62
    <2d5>   DW_AT_decl_column : 88
    <2d6>   DW_AT_type        : <0x2f6>
    <2da>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><2dd>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <2de>   DW_AT_name        : (indirect string, offset: 0x9a540): pulIdleTaskStackSize
    <2e2>   DW_AT_decl_file   : 1
    <2e2>   DW_AT_decl_line   : 62
    <2e3>   DW_AT_decl_column : 122
    <2e4>   DW_AT_type        : <0x2fb>
    <2e8>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><2eb>: Abbrev Number: 0
 <1><2ec>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <2ed>   DW_AT_byte_size   : 4
    <2ed>   DW_AT_type        : <0x2f1>
 <1><2f1>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <2f2>   DW_AT_byte_size   : 4
    <2f2>   DW_AT_type        : <0x1e6>
 <1><2f6>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <2f7>   DW_AT_byte_size   : 4
    <2f7>   DW_AT_type        : <0x1f9>
 <1><2fb>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <2fc>   DW_AT_byte_size   : 4
    <2fc>   DW_AT_type        : <0xb8>
 <1><300>: Abbrev Number: 0
  Compilation Unit @ offset 0x301:
   Length:        0xa7e (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x138
   Pointer Size:  4
 <0><30d>: Abbrev Number: 26 (DW_TAG_compile_unit)
    <30e>   DW_AT_producer    : (indirect string, offset: 0xdd5df): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <312>   DW_AT_language    : 29	(C11)
    <313>   DW_AT_name        : (indirect string, offset: 0xe28d5): D:/Projeto-WR/Rastreador_WR/Core/Src/main.c
    <317>   DW_AT_comp_dir    : (indirect string, offset: 0xa3403): D:/Projeto-WR/Rastreador_WR/STM32CubeIDE/Debug
    <31b>   DW_AT_ranges      : 0x2b
    <31f>   DW_AT_low_pc      : 0
    <323>   DW_AT_stmt_list   : 0x8b2
    <327>   DW_AT_macros      : 0x24149
 <1><32b>: Abbrev Number: 6 (DW_TAG_base_type)
    <32c>   DW_AT_byte_size   : 1
    <32d>   DW_AT_encoding    : 6	(signed char)
    <32e>   DW_AT_name        : (indirect string, offset: 0x71a3e): signed char
 <1><332>: Abbrev Number: 4 (DW_TAG_typedef)
    <333>   DW_AT_name        : (indirect string, offset: 0x41568): __uint8_t
    <337>   DW_AT_decl_file   : 2
    <338>   DW_AT_decl_line   : 43
    <339>   DW_AT_decl_column : 24
    <33a>   DW_AT_type        : <0x33e>
 <1><33e>: Abbrev Number: 6 (DW_TAG_base_type)
    <33f>   DW_AT_byte_size   : 1
    <340>   DW_AT_encoding    : 8	(unsigned char)
    <341>   DW_AT_name        : (indirect string, offset: 0xd95a4): unsigned char
 <1><345>: Abbrev Number: 6 (DW_TAG_base_type)
    <346>   DW_AT_byte_size   : 2
    <347>   DW_AT_encoding    : 5	(signed)
    <348>   DW_AT_name        : (indirect string, offset: 0xa6ff7): short int
 <1><34c>: Abbrev Number: 4 (DW_TAG_typedef)
    <34d>   DW_AT_name        : (indirect string, offset: 0xb7c7e): __uint16_t
    <351>   DW_AT_decl_file   : 2
    <352>   DW_AT_decl_line   : 57
    <353>   DW_AT_decl_column : 25
    <354>   DW_AT_type        : <0x358>
 <1><358>: Abbrev Number: 6 (DW_TAG_base_type)
    <359>   DW_AT_byte_size   : 2
    <35a>   DW_AT_encoding    : 7	(unsigned)
    <35b>   DW_AT_name        : (indirect string, offset: 0xd7cca): short unsigned int
 <1><35f>: Abbrev Number: 6 (DW_TAG_base_type)
    <360>   DW_AT_byte_size   : 4
    <361>   DW_AT_encoding    : 5	(signed)
    <362>   DW_AT_name        : (indirect string, offset: 0x12e56): long int
 <1><366>: Abbrev Number: 4 (DW_TAG_typedef)
    <367>   DW_AT_name        : (indirect string, offset: 0x8f8a3): __uint32_t
    <36b>   DW_AT_decl_file   : 2
    <36c>   DW_AT_decl_line   : 79
    <36d>   DW_AT_decl_column : 25
    <36e>   DW_AT_type        : <0x372>
 <1><372>: Abbrev Number: 6 (DW_TAG_base_type)
    <373>   DW_AT_byte_size   : 4
    <374>   DW_AT_encoding    : 7	(unsigned)
    <375>   DW_AT_name        : (indirect string, offset: 0x557a7): long unsigned int
 <1><379>: Abbrev Number: 6 (DW_TAG_base_type)
    <37a>   DW_AT_byte_size   : 8
    <37b>   DW_AT_encoding    : 5	(signed)
    <37c>   DW_AT_name        : (indirect string, offset: 0x666fa): long long int
 <1><380>: Abbrev Number: 6 (DW_TAG_base_type)
    <381>   DW_AT_byte_size   : 8
    <382>   DW_AT_encoding    : 7	(unsigned)
    <383>   DW_AT_name        : (indirect string, offset: 0x2ea30): long long unsigned int
 <1><387>: Abbrev Number: 27 (DW_TAG_base_type)
    <388>   DW_AT_byte_size   : 4
    <389>   DW_AT_encoding    : 5	(signed)
    <38a>   DW_AT_name        : int
 <1><38e>: Abbrev Number: 6 (DW_TAG_base_type)
    <38f>   DW_AT_byte_size   : 4
    <390>   DW_AT_encoding    : 7	(unsigned)
    <391>   DW_AT_name        : (indirect string, offset: 0x123d8): unsigned int
 <1><395>: Abbrev Number: 4 (DW_TAG_typedef)
    <396>   DW_AT_name        : (indirect string, offset: 0x4156a): uint8_t
    <39a>   DW_AT_decl_file   : 3
    <39b>   DW_AT_decl_line   : 24
    <39c>   DW_AT_decl_column : 19
    <39d>   DW_AT_type        : <0x332>
 <1><3a1>: Abbrev Number: 14 (DW_TAG_const_type)
    <3a2>   DW_AT_type        : <0x395>
 <1><3a6>: Abbrev Number: 4 (DW_TAG_typedef)
    <3a7>   DW_AT_name        : (indirect string, offset: 0xa3d58): uint16_t
    <3ab>   DW_AT_decl_file   : 3
    <3ac>   DW_AT_decl_line   : 36
    <3ad>   DW_AT_decl_column : 20
    <3ae>   DW_AT_type        : <0x34c>
 <1><3b2>: Abbrev Number: 4 (DW_TAG_typedef)
    <3b3>   DW_AT_name        : (indirect string, offset: 0xa31e3): uint32_t
    <3b7>   DW_AT_decl_file   : 3
    <3b8>   DW_AT_decl_line   : 48
    <3b9>   DW_AT_decl_column : 20
    <3ba>   DW_AT_type        : <0x366>
 <1><3be>: Abbrev Number: 19 (DW_TAG_volatile_type)
    <3bf>   DW_AT_type        : <0x3b2>
 <1><3c3>: Abbrev Number: 20 (DW_TAG_structure_type)
    <3c4>   DW_AT_byte_size   : 48
    <3c5>   DW_AT_decl_file   : 4
    <3c5>   DW_AT_decl_line   : 531
    <3c7>   DW_AT_decl_column : 9
    <3c7>   DW_AT_sibling     : <0x45e>
 <2><3cb>: Abbrev Number: 1 (DW_TAG_member)
    <3cc>   DW_AT_name        : (indirect string, offset: 0xe1d8a): MODER
    <3d0>   DW_AT_decl_file   : 4
    <3d1>   DW_AT_decl_line   : 533
    <3d3>   DW_AT_decl_column : 17
    <3d4>   DW_AT_type        : <0x3be>
    <3d8>   DW_AT_data_member_location: 0
 <2><3d9>: Abbrev Number: 1 (DW_TAG_member)
    <3da>   DW_AT_name        : (indirect string, offset: 0xe3abe): OTYPER
    <3de>   DW_AT_decl_file   : 4
    <3df>   DW_AT_decl_line   : 534
    <3e1>   DW_AT_decl_column : 17
    <3e2>   DW_AT_type        : <0x3be>
    <3e6>   DW_AT_data_member_location: 4
 <2><3e7>: Abbrev Number: 1 (DW_TAG_member)
    <3e8>   DW_AT_name        : (indirect string, offset: 0xe3ed9): OSPEEDR
    <3ec>   DW_AT_decl_file   : 4
    <3ed>   DW_AT_decl_line   : 535
    <3ef>   DW_AT_decl_column : 17
    <3f0>   DW_AT_type        : <0x3be>
    <3f4>   DW_AT_data_member_location: 8
 <2><3f5>: Abbrev Number: 1 (DW_TAG_member)
    <3f6>   DW_AT_name        : (indirect string, offset: 0xe36a6): PUPDR
    <3fa>   DW_AT_decl_file   : 4
    <3fb>   DW_AT_decl_line   : 536
    <3fd>   DW_AT_decl_column : 17
    <3fe>   DW_AT_type        : <0x3be>
    <402>   DW_AT_data_member_location: 12
 <2><403>: Abbrev Number: 8 (DW_TAG_member)
    <404>   DW_AT_name        : IDR
    <408>   DW_AT_decl_file   : 4
    <408>   DW_AT_decl_line   : 537
    <40a>   DW_AT_decl_column : 17
    <40a>   DW_AT_type        : <0x3be>
    <40e>   DW_AT_data_member_location: 16
 <2><40f>: Abbrev Number: 8 (DW_TAG_member)
    <410>   DW_AT_name        : ODR
    <414>   DW_AT_decl_file   : 4
    <414>   DW_AT_decl_line   : 538
    <416>   DW_AT_decl_column : 17
    <416>   DW_AT_type        : <0x3be>
    <41a>   DW_AT_data_member_location: 20
 <2><41b>: Abbrev Number: 1 (DW_TAG_member)
    <41c>   DW_AT_name        : (indirect string, offset: 0xe36a1): BSRR
    <420>   DW_AT_decl_file   : 4
    <421>   DW_AT_decl_line   : 539
    <423>   DW_AT_decl_column : 17
    <424>   DW_AT_type        : <0x3be>
    <428>   DW_AT_data_member_location: 24
 <2><429>: Abbrev Number: 1 (DW_TAG_member)
    <42a>   DW_AT_name        : (indirect string, offset: 0xe3eb1): LCKR
    <42e>   DW_AT_decl_file   : 4
    <42f>   DW_AT_decl_line   : 540
    <431>   DW_AT_decl_column : 17
    <432>   DW_AT_type        : <0x3be>
    <436>   DW_AT_data_member_location: 28
 <2><437>: Abbrev Number: 8 (DW_TAG_member)
    <438>   DW_AT_name        : AFR
    <43c>   DW_AT_decl_file   : 4
    <43c>   DW_AT_decl_line   : 541
    <43e>   DW_AT_decl_column : 17
    <43e>   DW_AT_type        : <0x46e>
    <442>   DW_AT_data_member_location: 32
 <2><443>: Abbrev Number: 8 (DW_TAG_member)
    <444>   DW_AT_name        : BRR
    <448>   DW_AT_decl_file   : 4
    <448>   DW_AT_decl_line   : 542
    <44a>   DW_AT_decl_column : 17
    <44a>   DW_AT_type        : <0x3be>
    <44e>   DW_AT_data_member_location: 40
 <2><44f>: Abbrev Number: 1 (DW_TAG_member)
    <450>   DW_AT_name        : (indirect string, offset: 0xe1d95): ASCR
    <454>   DW_AT_decl_file   : 4
    <455>   DW_AT_decl_line   : 543
    <457>   DW_AT_decl_column : 17
    <458>   DW_AT_type        : <0x3be>
    <45c>   DW_AT_data_member_location: 44
 <2><45d>: Abbrev Number: 0
 <1><45e>: Abbrev Number: 9 (DW_TAG_array_type)
    <45f>   DW_AT_type        : <0x3be>
    <463>   DW_AT_sibling     : <0x46e>
 <2><467>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <468>   DW_AT_type        : <0x38e>
    <46c>   DW_AT_upper_bound : 1
 <2><46d>: Abbrev Number: 0
 <1><46e>: Abbrev Number: 19 (DW_TAG_volatile_type)
    <46f>   DW_AT_type        : <0x45e>
 <1><473>: Abbrev Number: 11 (DW_TAG_typedef)
    <474>   DW_AT_name        : (indirect string, offset: 0xe4356): GPIO_TypeDef
    <478>   DW_AT_decl_file   : 4
    <479>   DW_AT_decl_line   : 545
    <47b>   DW_AT_decl_column : 3
    <47c>   DW_AT_type        : <0x3c3>
 <1><480>: Abbrev Number: 20 (DW_TAG_structure_type)
    <481>   DW_AT_byte_size   : 152
    <482>   DW_AT_decl_file   : 4
    <482>   DW_AT_decl_line   : 685
    <484>   DW_AT_decl_column : 9
    <484>   DW_AT_sibling     : <0x698>
 <2><488>: Abbrev Number: 8 (DW_TAG_member)
    <489>   DW_AT_name        : CR
    <48c>   DW_AT_decl_file   : 4
    <48c>   DW_AT_decl_line   : 687
    <48e>   DW_AT_decl_column : 17
    <48e>   DW_AT_type        : <0x3be>
    <492>   DW_AT_data_member_location: 0
 <2><493>: Abbrev Number: 1 (DW_TAG_member)
    <494>   DW_AT_name        : (indirect string, offset: 0xe3778): ICSCR
    <498>   DW_AT_decl_file   : 4
    <499>   DW_AT_decl_line   : 688
    <49b>   DW_AT_decl_column : 17
    <49c>   DW_AT_type        : <0x3be>
    <4a0>   DW_AT_data_member_location: 4
 <2><4a1>: Abbrev Number: 1 (DW_TAG_member)
    <4a2>   DW_AT_name        : (indirect string, offset: 0xe2b0d): CFGR
    <4a6>   DW_AT_decl_file   : 4
    <4a7>   DW_AT_decl_line   : 689
    <4a9>   DW_AT_decl_column : 17
    <4aa>   DW_AT_type        : <0x3be>
    <4ae>   DW_AT_data_member_location: 8
 <2><4af>: Abbrev Number: 1 (DW_TAG_member)
    <4b0>   DW_AT_name        : (indirect string, offset: 0xe38a7): PLLCFGR
    <4b4>   DW_AT_decl_file   : 4
    <4b5>   DW_AT_decl_line   : 690
    <4b7>   DW_AT_decl_column : 17
    <4b8>   DW_AT_type        : <0x3be>
    <4bc>   DW_AT_data_member_location: 12
 <2><4bd>: Abbrev Number: 1 (DW_TAG_member)
    <4be>   DW_AT_name        : (indirect string, offset: 0xe2b06): PLLSAI1CFGR
    <4c2>   DW_AT_decl_file   : 4
    <4c3>   DW_AT_decl_line   : 691
    <4c5>   DW_AT_decl_column : 17
    <4c6>   DW_AT_type        : <0x3be>
    <4ca>   DW_AT_data_member_location: 16
 <2><4cb>: Abbrev Number: 1 (DW_TAG_member)
    <4cc>   DW_AT_name        : (indirect string, offset: 0xe3735): PLLSAI2CFGR
    <4d0>   DW_AT_decl_file   : 4
    <4d1>   DW_AT_decl_line   : 692
    <4d3>   DW_AT_decl_column : 17
    <4d4>   DW_AT_type        : <0x3be>
    <4d8>   DW_AT_data_member_location: 20
 <2><4d9>: Abbrev Number: 1 (DW_TAG_member)
    <4da>   DW_AT_name        : (indirect string, offset: 0xe1d9a): CIER
    <4de>   DW_AT_decl_file   : 4
    <4df>   DW_AT_decl_line   : 693
    <4e1>   DW_AT_decl_column : 17
    <4e2>   DW_AT_type        : <0x3be>
    <4e6>   DW_AT_data_member_location: 24
 <2><4e7>: Abbrev Number: 1 (DW_TAG_member)
    <4e8>   DW_AT_name        : (indirect string, offset: 0xe1d9f): CIFR
    <4ec>   DW_AT_decl_file   : 4
    <4ed>   DW_AT_decl_line   : 694
    <4ef>   DW_AT_decl_column : 17
    <4f0>   DW_AT_type        : <0x3be>
    <4f4>   DW_AT_data_member_location: 28
 <2><4f5>: Abbrev Number: 1 (DW_TAG_member)
    <4f6>   DW_AT_name        : (indirect string, offset: 0xe1d90): CICR
    <4fa>   DW_AT_decl_file   : 4
    <4fb>   DW_AT_decl_line   : 695
    <4fd>   DW_AT_decl_column : 17
    <4fe>   DW_AT_type        : <0x3be>
    <502>   DW_AT_data_member_location: 32
 <2><503>: Abbrev Number: 1 (DW_TAG_member)
    <504>   DW_AT_name        : (indirect string, offset: 0xe41a8): RESERVED0
    <508>   DW_AT_decl_file   : 4
    <509>   DW_AT_decl_line   : 696
    <50b>   DW_AT_decl_column : 17
    <50c>   DW_AT_type        : <0x3b2>
    <510>   DW_AT_data_member_location: 36
 <2><511>: Abbrev Number: 1 (DW_TAG_member)
    <512>   DW_AT_name        : (indirect string, offset: 0xe3b96): AHB1RSTR
    <516>   DW_AT_decl_file   : 4
    <517>   DW_AT_decl_line   : 697
    <519>   DW_AT_decl_column : 17
    <51a>   DW_AT_type        : <0x3be>
    <51e>   DW_AT_data_member_location: 40
 <2><51f>: Abbrev Number: 1 (DW_TAG_member)
    <520>   DW_AT_name        : (indirect string, offset: 0xe2463): AHB2RSTR
    <524>   DW_AT_decl_file   : 4
    <525>   DW_AT_decl_line   : 698
    <527>   DW_AT_decl_column : 17
    <528>   DW_AT_type        : <0x3be>
    <52c>   DW_AT_data_member_location: 44
 <2><52d>: Abbrev Number: 1 (DW_TAG_member)
    <52e>   DW_AT_name        : (indirect string, offset: 0xe2afd): AHB3RSTR
    <532>   DW_AT_decl_file   : 4
    <533>   DW_AT_decl_line   : 699
    <535>   DW_AT_decl_column : 17
    <536>   DW_AT_type        : <0x3be>
    <53a>   DW_AT_data_member_location: 48
 <2><53b>: Abbrev Number: 1 (DW_TAG_member)
    <53c>   DW_AT_name        : (indirect string, offset: 0xe41b2): RESERVED1
    <540>   DW_AT_decl_file   : 4
    <541>   DW_AT_decl_line   : 700
    <543>   DW_AT_decl_column : 17
    <544>   DW_AT_type        : <0x3b2>
    <548>   DW_AT_data_member_location: 52
 <2><549>: Abbrev Number: 1 (DW_TAG_member)
    <54a>   DW_AT_name        : (indirect string, offset: 0xe2543): APB1RSTR1
    <54e>   DW_AT_decl_file   : 4
    <54f>   DW_AT_decl_line   : 701
    <551>   DW_AT_decl_column : 17
    <552>   DW_AT_type        : <0x3be>
    <556>   DW_AT_data_member_location: 56
 <2><557>: Abbrev Number: 1 (DW_TAG_member)
    <558>   DW_AT_name        : (indirect string, offset: 0xe254d): APB1RSTR2
    <55c>   DW_AT_decl_file   : 4
    <55d>   DW_AT_decl_line   : 702
    <55f>   DW_AT_decl_column : 17
    <560>   DW_AT_type        : <0x3be>
    <564>   DW_AT_data_member_location: 60
 <2><565>: Abbrev Number: 1 (DW_TAG_member)
    <566>   DW_AT_name        : (indirect string, offset: 0xe2d29): APB2RSTR
    <56a>   DW_AT_decl_file   : 4
    <56b>   DW_AT_decl_line   : 703
    <56d>   DW_AT_decl_column : 17
    <56e>   DW_AT_type        : <0x3be>
    <572>   DW_AT_data_member_location: 64
 <2><573>: Abbrev Number: 1 (DW_TAG_member)
    <574>   DW_AT_name        : (indirect string, offset: 0xe41bc): RESERVED2
    <578>   DW_AT_decl_file   : 4
    <579>   DW_AT_decl_line   : 704
    <57b>   DW_AT_decl_column : 17
    <57c>   DW_AT_type        : <0x3b2>
    <580>   DW_AT_data_member_location: 68
 <2><581>: Abbrev Number: 1 (DW_TAG_member)
    <582>   DW_AT_name        : (indirect string, offset: 0xe211a): AHB1ENR
    <586>   DW_AT_decl_file   : 4
    <587>   DW_AT_decl_line   : 705
    <589>   DW_AT_decl_column : 17
    <58a>   DW_AT_type        : <0x3be>
    <58e>   DW_AT_data_member_location: 72
 <2><58f>: Abbrev Number: 1 (DW_TAG_member)
    <590>   DW_AT_name        : (indirect string, offset: 0xe27d4): AHB2ENR
    <594>   DW_AT_decl_file   : 4
    <595>   DW_AT_decl_line   : 706
    <597>   DW_AT_decl_column : 17
    <598>   DW_AT_type        : <0x3be>
    <59c>   DW_AT_data_member_location: 76
 <2><59d>: Abbrev Number: 1 (DW_TAG_member)
    <59e>   DW_AT_name        : (indirect string, offset: 0xe2e00): AHB3ENR
    <5a2>   DW_AT_decl_file   : 4
    <5a3>   DW_AT_decl_line   : 707
    <5a5>   DW_AT_decl_column : 17
    <5a6>   DW_AT_type        : <0x3be>
    <5aa>   DW_AT_data_member_location: 80
 <2><5ab>: Abbrev Number: 1 (DW_TAG_member)
    <5ac>   DW_AT_name        : (indirect string, offset: 0xe41c6): RESERVED3
    <5b0>   DW_AT_decl_file   : 4
    <5b1>   DW_AT_decl_line   : 708
    <5b3>   DW_AT_decl_column : 17
    <5b4>   DW_AT_type        : <0x3b2>
    <5b8>   DW_AT_data_member_location: 84
 <2><5b9>: Abbrev Number: 1 (DW_TAG_member)
    <5ba>   DW_AT_name        : (indirect string, offset: 0xe1da4): APB1ENR1
    <5be>   DW_AT_decl_file   : 4
    <5bf>   DW_AT_decl_line   : 709
    <5c1>   DW_AT_decl_column : 17
    <5c2>   DW_AT_type        : <0x3be>
    <5c6>   DW_AT_data_member_location: 88
 <2><5c7>: Abbrev Number: 1 (DW_TAG_member)
    <5c8>   DW_AT_name        : (indirect string, offset: 0xe1dad): APB1ENR2
    <5cc>   DW_AT_decl_file   : 4
    <5cd>   DW_AT_decl_line   : 710
    <5cf>   DW_AT_decl_column : 17
    <5d0>   DW_AT_type        : <0x3be>
    <5d4>   DW_AT_data_member_location: 92
 <2><5d5>: Abbrev Number: 1 (DW_TAG_member)
    <5d6>   DW_AT_name        : (indirect string, offset: 0xe2216): APB2ENR
    <5da>   DW_AT_decl_file   : 4
    <5db>   DW_AT_decl_line   : 711
    <5dd>   DW_AT_decl_column : 17
    <5de>   DW_AT_type        : <0x3be>
    <5e2>   DW_AT_data_member_location: 96
 <2><5e3>: Abbrev Number: 1 (DW_TAG_member)
    <5e4>   DW_AT_name        : (indirect string, offset: 0xe3fe2): RESERVED4
    <5e8>   DW_AT_decl_file   : 4
    <5e9>   DW_AT_decl_line   : 712
    <5eb>   DW_AT_decl_column : 17
    <5ec>   DW_AT_type        : <0x3b2>
    <5f0>   DW_AT_data_member_location: 100
 <2><5f1>: Abbrev Number: 1 (DW_TAG_member)
    <5f2>   DW_AT_name        : (indirect string, offset: 0xe2ed4): AHB1SMENR
    <5f6>   DW_AT_decl_file   : 4
    <5f7>   DW_AT_decl_line   : 713
    <5f9>   DW_AT_decl_column : 17
    <5fa>   DW_AT_type        : <0x3be>
    <5fe>   DW_AT_data_member_location: 104
 <2><5ff>: Abbrev Number: 1 (DW_TAG_member)
    <600>   DW_AT_name        : (indirect string, offset: 0xe406b): AHB2SMENR
    <604>   DW_AT_decl_file   : 4
    <605>   DW_AT_decl_line   : 714
    <607>   DW_AT_decl_column : 17
    <608>   DW_AT_type        : <0x3be>
    <60c>   DW_AT_data_member_location: 108
 <2><60d>: Abbrev Number: 1 (DW_TAG_member)
    <60e>   DW_AT_name        : (indirect string, offset: 0xe2c14): AHB3SMENR
    <612>   DW_AT_decl_file   : 4
    <613>   DW_AT_decl_line   : 715
    <615>   DW_AT_decl_column : 17
    <616>   DW_AT_type        : <0x3be>
    <61a>   DW_AT_data_member_location: 112
 <2><61b>: Abbrev Number: 1 (DW_TAG_member)
    <61c>   DW_AT_name        : (indirect string, offset: 0xe41d0): RESERVED5
    <620>   DW_AT_decl_file   : 4
    <621>   DW_AT_decl_line   : 716
    <623>   DW_AT_decl_column : 17
    <624>   DW_AT_type        : <0x3b2>
    <628>   DW_AT_data_member_location: 116
 <2><629>: Abbrev Number: 1 (DW_TAG_member)
    <62a>   DW_AT_name        : (indirect string, offset: 0xe1db6): APB1SMENR1
    <62e>   DW_AT_decl_file   : 4
    <62f>   DW_AT_decl_line   : 717
    <631>   DW_AT_decl_column : 17
    <632>   DW_AT_type        : <0x3be>
    <636>   DW_AT_data_member_location: 120
 <2><637>: Abbrev Number: 1 (DW_TAG_member)
    <638>   DW_AT_name        : (indirect string, offset: 0xe1dc1): APB1SMENR2
    <63c>   DW_AT_decl_file   : 4
    <63d>   DW_AT_decl_line   : 718
    <63f>   DW_AT_decl_column : 17
    <640>   DW_AT_type        : <0x3be>
    <644>   DW_AT_data_member_location: 124
 <2><645>: Abbrev Number: 1 (DW_TAG_member)
    <646>   DW_AT_name        : (indirect string, offset: 0xe3baf): APB2SMENR
    <64a>   DW_AT_decl_file   : 4
    <64b>   DW_AT_decl_line   : 719
    <64d>   DW_AT_decl_column : 17
    <64e>   DW_AT_type        : <0x3be>
    <652>   DW_AT_data_member_location: 128
 <2><653>: Abbrev Number: 1 (DW_TAG_member)
    <654>   DW_AT_name        : (indirect string, offset: 0xe41da): RESERVED6
    <658>   DW_AT_decl_file   : 4
    <659>   DW_AT_decl_line   : 720
    <65b>   DW_AT_decl_column : 17
    <65c>   DW_AT_type        : <0x3b2>
    <660>   DW_AT_data_member_location: 132
 <2><661>: Abbrev Number: 1 (DW_TAG_member)
    <662>   DW_AT_name        : (indirect string, offset: 0xe29fb): CCIPR
    <666>   DW_AT_decl_file   : 4
    <667>   DW_AT_decl_line   : 721
    <669>   DW_AT_decl_column : 17
    <66a>   DW_AT_type        : <0x3be>
    <66e>   DW_AT_data_member_location: 136
 <2><66f>: Abbrev Number: 1 (DW_TAG_member)
    <670>   DW_AT_name        : (indirect string, offset: 0xe41e4): RESERVED7
    <674>   DW_AT_decl_file   : 4
    <675>   DW_AT_decl_line   : 722
    <677>   DW_AT_decl_column : 17
    <678>   DW_AT_type        : <0x3b2>
    <67c>   DW_AT_data_member_location: 140
 <2><67d>: Abbrev Number: 1 (DW_TAG_member)
    <67e>   DW_AT_name        : (indirect string, offset: 0xe2747): BDCR
    <682>   DW_AT_decl_file   : 4
    <683>   DW_AT_decl_line   : 723
    <685>   DW_AT_decl_column : 17
    <686>   DW_AT_type        : <0x3be>
    <68a>   DW_AT_data_member_location: 144
 <2><68b>: Abbrev Number: 8 (DW_TAG_member)
    <68c>   DW_AT_name        : CSR
    <690>   DW_AT_decl_file   : 4
    <690>   DW_AT_decl_line   : 724
    <692>   DW_AT_decl_column : 17
    <692>   DW_AT_type        : <0x3be>
    <696>   DW_AT_data_member_location: 148
 <2><697>: Abbrev Number: 0
 <1><698>: Abbrev Number: 11 (DW_TAG_typedef)
    <699>   DW_AT_name        : (indirect string, offset: 0xe2f11): RCC_TypeDef
    <69d>   DW_AT_decl_file   : 4
    <69e>   DW_AT_decl_line   : 725
    <6a0>   DW_AT_decl_column : 3
    <6a1>   DW_AT_type        : <0x480>
 <1><6a5>: Abbrev Number: 6 (DW_TAG_base_type)
    <6a6>   DW_AT_byte_size   : 8
    <6a7>   DW_AT_encoding    : 4	(float)
    <6a8>   DW_AT_name        : (indirect string, offset: 0xe946a): long double
 <1><6ac>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <6ad>   DW_AT_encoding    : 7	(unsigned)
    <6ae>   DW_AT_byte_size   : 1
    <6af>   DW_AT_type        : <0x33e>
    <6b3>   DW_AT_decl_file   : 5
    <6b4>   DW_AT_decl_line   : 39
    <6b5>   DW_AT_decl_column : 1
    <6b6>   DW_AT_sibling     : <0x6d3>
 <2><6ba>: Abbrev Number: 3 (DW_TAG_enumerator)
    <6bb>   DW_AT_name        : (indirect string, offset: 0xe2b12): HAL_OK
    <6bf>   DW_AT_const_value : 0
 <2><6c0>: Abbrev Number: 3 (DW_TAG_enumerator)
    <6c1>   DW_AT_name        : (indirect string, offset: 0xe35bd): HAL_ERROR
    <6c5>   DW_AT_const_value : 1
 <2><6c6>: Abbrev Number: 3 (DW_TAG_enumerator)
    <6c7>   DW_AT_name        : (indirect string, offset: 0xe23a6): HAL_BUSY
    <6cb>   DW_AT_const_value : 2
 <2><6cc>: Abbrev Number: 3 (DW_TAG_enumerator)
    <6cd>   DW_AT_name        : (indirect string, offset: 0xe2901): HAL_TIMEOUT
    <6d1>   DW_AT_const_value : 3
 <2><6d2>: Abbrev Number: 0
 <1><6d3>: Abbrev Number: 4 (DW_TAG_typedef)
    <6d4>   DW_AT_name        : (indirect string, offset: 0xe42d4): HAL_StatusTypeDef
    <6d8>   DW_AT_decl_file   : 5
    <6d9>   DW_AT_decl_line   : 44
    <6da>   DW_AT_decl_column : 3
    <6db>   DW_AT_type        : <0x6ac>
 <1><6df>: Abbrev Number: 16 (DW_TAG_structure_type)
    <6e0>   DW_AT_byte_size   : 28
    <6e1>   DW_AT_decl_file   : 6
    <6e2>   DW_AT_decl_line   : 45
    <6e3>   DW_AT_decl_column : 9
    <6e3>   DW_AT_sibling     : <0x73c>
 <2><6e7>: Abbrev Number: 2 (DW_TAG_member)
    <6e8>   DW_AT_name        : (indirect string, offset: 0xe376f): PLLState
    <6ec>   DW_AT_decl_file   : 6
    <6ed>   DW_AT_decl_line   : 47
    <6ee>   DW_AT_decl_column : 12
    <6ee>   DW_AT_type        : <0x3b2>
    <6f2>   DW_AT_data_member_location: 0
 <2><6f3>: Abbrev Number: 2 (DW_TAG_member)
    <6f4>   DW_AT_name        : (indirect string, offset: 0xe389d): PLLSource
    <6f8>   DW_AT_decl_file   : 6
    <6f9>   DW_AT_decl_line   : 50
    <6fa>   DW_AT_decl_column : 12
    <6fa>   DW_AT_type        : <0x3b2>
    <6fe>   DW_AT_data_member_location: 4
 <2><6ff>: Abbrev Number: 2 (DW_TAG_member)
    <700>   DW_AT_name        : (indirect string, offset: 0xe36ac): PLLM
    <704>   DW_AT_decl_file   : 6
    <705>   DW_AT_decl_line   : 53
    <706>   DW_AT_decl_column : 12
    <706>   DW_AT_type        : <0x3b2>
    <70a>   DW_AT_data_member_location: 8
 <2><70b>: Abbrev Number: 2 (DW_TAG_member)
    <70c>   DW_AT_name        : (indirect string, offset: 0xe3d0e): PLLN
    <710>   DW_AT_decl_file   : 6
    <711>   DW_AT_decl_line   : 57
    <712>   DW_AT_decl_column : 12
    <712>   DW_AT_type        : <0x3b2>
    <716>   DW_AT_data_member_location: 12
 <2><717>: Abbrev Number: 2 (DW_TAG_member)
    <718>   DW_AT_name        : (indirect string, offset: 0xe3d13): PLLP
    <71c>   DW_AT_decl_file   : 6
    <71d>   DW_AT_decl_line   : 61
    <71e>   DW_AT_decl_column : 12
    <71e>   DW_AT_type        : <0x3b2>
    <722>   DW_AT_data_member_location: 16
 <2><723>: Abbrev Number: 2 (DW_TAG_member)
    <724>   DW_AT_name        : (indirect string, offset: 0xa3327): PLLQ
    <728>   DW_AT_decl_file   : 6
    <729>   DW_AT_decl_line   : 65
    <72a>   DW_AT_decl_column : 12
    <72a>   DW_AT_type        : <0x3b2>
    <72e>   DW_AT_data_member_location: 20
 <2><72f>: Abbrev Number: 2 (DW_TAG_member)
    <730>   DW_AT_name        : (indirect string, offset: 0xe3d18): PLLR
    <734>   DW_AT_decl_file   : 6
    <735>   DW_AT_decl_line   : 68
    <736>   DW_AT_decl_column : 12
    <736>   DW_AT_type        : <0x3b2>
    <73a>   DW_AT_data_member_location: 24
 <2><73b>: Abbrev Number: 0
 <1><73c>: Abbrev Number: 4 (DW_TAG_typedef)
    <73d>   DW_AT_name        : (indirect string, offset: 0xe342a): RCC_PLLInitTypeDef
    <741>   DW_AT_decl_file   : 6
    <742>   DW_AT_decl_line   : 73
    <743>   DW_AT_decl_column : 2
    <744>   DW_AT_type        : <0x6df>
 <1><748>: Abbrev Number: 16 (DW_TAG_structure_type)
    <749>   DW_AT_byte_size   : 68
    <74a>   DW_AT_decl_file   : 6
    <74b>   DW_AT_decl_line   : 78
    <74c>   DW_AT_decl_column : 9
    <74c>   DW_AT_sibling     : <0x7d6>
 <2><750>: Abbrev Number: 2 (DW_TAG_member)
    <751>   DW_AT_name        : (indirect string, offset: 0xe3c53): OscillatorType
    <755>   DW_AT_decl_file   : 6
    <756>   DW_AT_decl_line   : 80
    <757>   DW_AT_decl_column : 12
    <757>   DW_AT_type        : <0x3b2>
    <75b>   DW_AT_data_member_location: 0
 <2><75c>: Abbrev Number: 2 (DW_TAG_member)
    <75d>   DW_AT_name        : (indirect string, offset: 0xe3788): HSEState
    <761>   DW_AT_decl_file   : 6
    <762>   DW_AT_decl_line   : 83
    <763>   DW_AT_decl_column : 12
    <763>   DW_AT_type        : <0x3b2>
    <767>   DW_AT_data_member_location: 4
 <2><768>: Abbrev Number: 2 (DW_TAG_member)
    <769>   DW_AT_name        : (indirect string, offset: 0xe2c5f): LSEState
    <76d>   DW_AT_decl_file   : 6
    <76e>   DW_AT_decl_line   : 86
    <76f>   DW_AT_decl_column : 12
    <76f>   DW_AT_type        : <0x3b2>
    <773>   DW_AT_data_member_location: 8
 <2><774>: Abbrev Number: 2 (DW_TAG_member)
    <775>   DW_AT_name        : (indirect string, offset: 0xe2df7): HSIState
    <779>   DW_AT_decl_file   : 6
    <77a>   DW_AT_decl_line   : 89
    <77b>   DW_AT_decl_column : 12
    <77b>   DW_AT_type        : <0x3b2>
    <77f>   DW_AT_data_member_location: 12
 <2><780>: Abbrev Number: 2 (DW_TAG_member)
    <781>   DW_AT_name        : (indirect string, offset: 0xe3eb6): HSICalibrationValue
    <785>   DW_AT_decl_file   : 6
    <786>   DW_AT_decl_line   : 92
    <787>   DW_AT_decl_column : 12
    <787>   DW_AT_type        : <0x3b2>
    <78b>   DW_AT_data_member_location: 16
 <2><78c>: Abbrev Number: 2 (DW_TAG_member)
    <78d>   DW_AT_name        : (indirect string, offset: 0xe2bca): LSIState
    <791>   DW_AT_decl_file   : 6
    <792>   DW_AT_decl_line   : 98
    <793>   DW_AT_decl_column : 12
    <793>   DW_AT_type        : <0x3b2>
    <797>   DW_AT_data_member_location: 20
 <2><798>: Abbrev Number: 2 (DW_TAG_member)
    <799>   DW_AT_name        : (indirect string, offset: 0xe2b19): MSIState
    <79d>   DW_AT_decl_file   : 6
    <79e>   DW_AT_decl_line   : 106
    <79f>   DW_AT_decl_column : 12
    <79f>   DW_AT_type        : <0x3b2>
    <7a3>   DW_AT_data_member_location: 24
 <2><7a4>: Abbrev Number: 2 (DW_TAG_member)
    <7a5>   DW_AT_name        : (indirect string, offset: 0xe29e7): MSICalibrationValue
    <7a9>   DW_AT_decl_file   : 6
    <7aa>   DW_AT_decl_line   : 109
    <7ab>   DW_AT_decl_column : 12
    <7ab>   DW_AT_type        : <0x3b2>
    <7af>   DW_AT_data_member_location: 28
 <2><7b0>: Abbrev Number: 2 (DW_TAG_member)
    <7b1>   DW_AT_name        : (indirect string, offset: 0xe3121): MSIClockRange
    <7b5>   DW_AT_decl_file   : 6
    <7b6>   DW_AT_decl_line   : 112
    <7b7>   DW_AT_decl_column : 12
    <7b7>   DW_AT_type        : <0x3b2>
    <7bb>   DW_AT_data_member_location: 32
 <2><7bc>: Abbrev Number: 2 (DW_TAG_member)
    <7bd>   DW_AT_name        : (indirect string, offset: 0xe38af): HSI48State
    <7c1>   DW_AT_decl_file   : 6
    <7c2>   DW_AT_decl_line   : 115
    <7c3>   DW_AT_decl_column : 12
    <7c3>   DW_AT_type        : <0x3b2>
    <7c7>   DW_AT_data_member_location: 36
 <2><7c8>: Abbrev Number: 21 (DW_TAG_member)
    <7c9>   DW_AT_name        : PLL
    <7cd>   DW_AT_decl_file   : 6
    <7ce>   DW_AT_decl_line   : 118
    <7cf>   DW_AT_decl_column : 22
    <7d0>   DW_AT_type        : <0x73c>
    <7d4>   DW_AT_data_member_location: 40
 <2><7d5>: Abbrev Number: 0
 <1><7d6>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d7>   DW_AT_name        : (indirect string, offset: 0xe3197): RCC_OscInitTypeDef
    <7db>   DW_AT_decl_file   : 6
    <7dc>   DW_AT_decl_line   : 120
    <7dd>   DW_AT_decl_column : 2
    <7de>   DW_AT_type        : <0x748>
 <1><7e2>: Abbrev Number: 16 (DW_TAG_structure_type)
    <7e3>   DW_AT_byte_size   : 20
    <7e4>   DW_AT_decl_file   : 6
    <7e5>   DW_AT_decl_line   : 125
    <7e6>   DW_AT_decl_column : 9
    <7e6>   DW_AT_sibling     : <0x827>
 <2><7ea>: Abbrev Number: 2 (DW_TAG_member)
    <7eb>   DW_AT_name        : (indirect string, offset: 0xe2a01): ClockType
    <7ef>   DW_AT_decl_file   : 6
    <7f0>   DW_AT_decl_line   : 127
    <7f1>   DW_AT_decl_column : 12
    <7f1>   DW_AT_type        : <0x3b2>
    <7f5>   DW_AT_data_member_location: 0
 <2><7f6>: Abbrev Number: 2 (DW_TAG_member)
    <7f7>   DW_AT_name        : (indirect string, offset: 0xe341d): SYSCLKSource
    <7fb>   DW_AT_decl_file   : 6
    <7fc>   DW_AT_decl_line   : 130
    <7fd>   DW_AT_decl_column : 12
    <7fd>   DW_AT_type        : <0x3b2>
    <801>   DW_AT_data_member_location: 4
 <2><802>: Abbrev Number: 2 (DW_TAG_member)
    <803>   DW_AT_name        : (indirect string, offset: 0xe3d00): AHBCLKDivider
    <807>   DW_AT_decl_file   : 6
    <808>   DW_AT_decl_line   : 133
    <809>   DW_AT_decl_column : 12
    <809>   DW_AT_type        : <0x3b2>
    <80d>   DW_AT_data_member_location: 8
 <2><80e>: Abbrev Number: 2 (DW_TAG_member)
    <80f>   DW_AT_name        : (indirect string, offset: 0xe1df2): APB1CLKDivider
    <813>   DW_AT_decl_file   : 6
    <814>   DW_AT_decl_line   : 136
    <815>   DW_AT_decl_column : 12
    <815>   DW_AT_type        : <0x3b2>
    <819>   DW_AT_data_member_location: 12
 <2><81a>: Abbrev Number: 2 (DW_TAG_member)
    <81b>   DW_AT_name        : (indirect string, offset: 0xe2ec5): APB2CLKDivider
    <81f>   DW_AT_decl_file   : 6
    <820>   DW_AT_decl_line   : 139
    <821>   DW_AT_decl_column : 12
    <821>   DW_AT_type        : <0x3b2>
    <825>   DW_AT_data_member_location: 16
 <2><826>: Abbrev Number: 0
 <1><827>: Abbrev Number: 4 (DW_TAG_typedef)
    <828>   DW_AT_name        : (indirect string, offset: 0xe2a0b): RCC_ClkInitTypeDef
    <82c>   DW_AT_decl_file   : 6
    <82d>   DW_AT_decl_line   : 142
    <82e>   DW_AT_decl_column : 2
    <82f>   DW_AT_type        : <0x7e2>
 <1><833>: Abbrev Number: 14 (DW_TAG_const_type)
    <834>   DW_AT_type        : <0x827>
 <1><838>: Abbrev Number: 16 (DW_TAG_structure_type)
    <839>   DW_AT_byte_size   : 20
    <83a>   DW_AT_decl_file   : 7
    <83b>   DW_AT_decl_line   : 46
    <83c>   DW_AT_decl_column : 9
    <83c>   DW_AT_sibling     : <0x87e>
 <2><840>: Abbrev Number: 21 (DW_TAG_member)
    <841>   DW_AT_name        : Pin
    <845>   DW_AT_decl_file   : 7
    <846>   DW_AT_decl_line   : 48
    <847>   DW_AT_decl_column : 12
    <848>   DW_AT_type        : <0x3b2>
    <84c>   DW_AT_data_member_location: 0
 <2><84d>: Abbrev Number: 2 (DW_TAG_member)
    <84e>   DW_AT_name        : (indirect string, offset: 0xe5c49): Mode
    <852>   DW_AT_decl_file   : 7
    <853>   DW_AT_decl_line   : 51
    <854>   DW_AT_decl_column : 12
    <854>   DW_AT_type        : <0x3b2>
    <858>   DW_AT_data_member_location: 4
 <2><859>: Abbrev Number: 2 (DW_TAG_member)
    <85a>   DW_AT_name        : (indirect string, offset: 0xe312f): Pull
    <85e>   DW_AT_decl_file   : 7
    <85f>   DW_AT_decl_line   : 54
    <860>   DW_AT_decl_column : 12
    <860>   DW_AT_type        : <0x3b2>
    <864>   DW_AT_data_member_location: 8
 <2><865>: Abbrev Number: 2 (DW_TAG_member)
    <866>   DW_AT_name        : (indirect string, offset: 0xe3373): Speed
    <86a>   DW_AT_decl_file   : 7
    <86b>   DW_AT_decl_line   : 57
    <86c>   DW_AT_decl_column : 12
    <86c>   DW_AT_type        : <0x3b2>
    <870>   DW_AT_data_member_location: 12
 <2><871>: Abbrev Number: 2 (DW_TAG_member)
    <872>   DW_AT_name        : (indirect string, offset: 0xe2ebb): Alternate
    <876>   DW_AT_decl_file   : 7
    <877>   DW_AT_decl_line   : 60
    <878>   DW_AT_decl_column : 12
    <878>   DW_AT_type        : <0x3b2>
    <87c>   DW_AT_data_member_location: 16
 <2><87d>: Abbrev Number: 0
 <1><87e>: Abbrev Number: 4 (DW_TAG_typedef)
    <87f>   DW_AT_name        : (indirect string, offset: 0xe3b5c): GPIO_InitTypeDef
    <883>   DW_AT_decl_file   : 7
    <884>   DW_AT_decl_line   : 62
    <885>   DW_AT_decl_column : 3
    <886>   DW_AT_type        : <0x838>
 <1><88a>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <88b>   DW_AT_encoding    : 7	(unsigned)
    <88c>   DW_AT_byte_size   : 1
    <88d>   DW_AT_type        : <0x33e>
    <891>   DW_AT_decl_file   : 7
    <892>   DW_AT_decl_line   : 68
    <893>   DW_AT_decl_column : 1
    <894>   DW_AT_sibling     : <0x8a5>
 <2><898>: Abbrev Number: 3 (DW_TAG_enumerator)
    <899>   DW_AT_name        : (indirect string, offset: 0xe2557): GPIO_PIN_RESET
    <89d>   DW_AT_const_value : 0
 <2><89e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <89f>   DW_AT_name        : (indirect string, offset: 0xe273a): GPIO_PIN_SET
    <8a3>   DW_AT_const_value : 1
 <2><8a4>: Abbrev Number: 0
 <1><8a5>: Abbrev Number: 4 (DW_TAG_typedef)
    <8a6>   DW_AT_name        : (indirect string, offset: 0xe4363): GPIO_PinState
    <8aa>   DW_AT_decl_file   : 7
    <8ab>   DW_AT_decl_line   : 71
    <8ac>   DW_AT_decl_column : 3
    <8ad>   DW_AT_type        : <0x88a>
 <1><8b1>: Abbrev Number: 9 (DW_TAG_array_type)
    <8b2>   DW_AT_type        : <0x3a1>
    <8b6>   DW_AT_sibling     : <0x8c1>
 <2><8ba>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <8bb>   DW_AT_type        : <0x38e>
    <8bf>   DW_AT_upper_bound : 6
 <2><8c0>: Abbrev Number: 0
 <1><8c1>: Abbrev Number: 14 (DW_TAG_const_type)
    <8c2>   DW_AT_type        : <0x8b1>
 <1><8c6>: Abbrev Number: 12 (DW_TAG_variable)
    <8c7>   DW_AT_name        : (indirect string, offset: 0x2c15d): CHANNEL_OFFSET_TAB
    <8cb>   DW_AT_decl_file   : 14
    <8cc>   DW_AT_decl_line   : 49
    <8cd>   DW_AT_decl_column : 22
    <8ce>   DW_AT_type        : <0x8c1>
    <8d2>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><8d8>: Abbrev Number: 28 (DW_TAG_pointer_type)
    <8d9>   DW_AT_byte_size   : 4
 <1><8da>: Abbrev Number: 4 (DW_TAG_typedef)
    <8db>   DW_AT_name        : (indirect string, offset: 0x1748): UBaseType_t
    <8df>   DW_AT_decl_file   : 8
    <8e0>   DW_AT_decl_line   : 57
    <8e1>   DW_AT_decl_column : 23
    <8e2>   DW_AT_type        : <0x372>
 <1><8e6>: Abbrev Number: 4 (DW_TAG_typedef)
    <8e7>   DW_AT_name        : (indirect string, offset: 0x7c2a6): TickType_t
    <8eb>   DW_AT_decl_file   : 8
    <8ec>   DW_AT_decl_line   : 63
    <8ed>   DW_AT_decl_column : 19
    <8ee>   DW_AT_type        : <0x3b2>
 <1><8f2>: Abbrev Number: 17 (DW_TAG_structure_type)
    <8f3>   DW_AT_name        : (indirect string, offset: 0xbc23e): xSTATIC_LIST_ITEM
    <8f7>   DW_AT_byte_size   : 20
    <8f8>   DW_AT_decl_file   : 9
    <8f9>   DW_AT_decl_line   : 1061
    <8fb>   DW_AT_decl_column : 8
    <8fc>   DW_AT_sibling     : <0x91d>
 <2><900>: Abbrev Number: 1 (DW_TAG_member)
    <901>   DW_AT_name        : (indirect string, offset: 0xe6ad7): xDummy2
    <905>   DW_AT_decl_file   : 9
    <906>   DW_AT_decl_line   : 1066
    <908>   DW_AT_decl_column : 13
    <909>   DW_AT_type        : <0x8e6>
    <90d>   DW_AT_data_member_location: 0
 <2><90e>: Abbrev Number: 1 (DW_TAG_member)
    <90f>   DW_AT_name        : (indirect string, offset: 0x50d43): pvDummy3
    <913>   DW_AT_decl_file   : 9
    <914>   DW_AT_decl_line   : 1067
    <916>   DW_AT_decl_column : 8
    <917>   DW_AT_type        : <0x91d>
    <91b>   DW_AT_data_member_location: 4
 <2><91c>: Abbrev Number: 0
 <1><91d>: Abbrev Number: 9 (DW_TAG_array_type)
    <91e>   DW_AT_type        : <0x8d8>
    <922>   DW_AT_sibling     : <0x92d>
 <2><926>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <927>   DW_AT_type        : <0x38e>
    <92b>   DW_AT_upper_bound : 3
 <2><92c>: Abbrev Number: 0
 <1><92d>: Abbrev Number: 11 (DW_TAG_typedef)
    <92e>   DW_AT_name        : (indirect string, offset: 0xa98f2): StaticListItem_t
    <932>   DW_AT_decl_file   : 9
    <933>   DW_AT_decl_line   : 1072
    <935>   DW_AT_decl_column : 34
    <936>   DW_AT_type        : <0x8f2>
 <1><93a>: Abbrev Number: 17 (DW_TAG_structure_type)
    <93b>   DW_AT_name        : (indirect string, offset: 0x6a7c3): xSTATIC_TCB
    <93f>   DW_AT_byte_size   : 84
    <940>   DW_AT_decl_file   : 9
    <941>   DW_AT_decl_line   : 1112
    <943>   DW_AT_decl_column : 16
    <944>   DW_AT_sibling     : <0x9c7>
 <2><948>: Abbrev Number: 1 (DW_TAG_member)
    <949>   DW_AT_name        : (indirect string, offset: 0x2daca): pxDummy1
    <94d>   DW_AT_decl_file   : 9
    <94e>   DW_AT_decl_line   : 1114
    <950>   DW_AT_decl_column : 11
    <951>   DW_AT_type        : <0x8d8>
    <955>   DW_AT_data_member_location: 0
 <2><956>: Abbrev Number: 1 (DW_TAG_member)
    <957>   DW_AT_name        : (indirect string, offset: 0x2ab37): xDummy3
    <95b>   DW_AT_decl_file   : 9
    <95c>   DW_AT_decl_line   : 1118
    <95e>   DW_AT_decl_column : 19
    <95f>   DW_AT_type        : <0x9c7>
    <963>   DW_AT_data_member_location: 4
 <2><964>: Abbrev Number: 1 (DW_TAG_member)
    <965>   DW_AT_name        : (indirect string, offset: 0x1ef1d): uxDummy5
    <969>   DW_AT_decl_file   : 9
    <96a>   DW_AT_decl_line   : 1119
    <96c>   DW_AT_decl_column : 16
    <96d>   DW_AT_type        : <0x8da>
    <971>   DW_AT_data_member_location: 44
 <2><972>: Abbrev Number: 1 (DW_TAG_member)
    <973>   DW_AT_name        : (indirect string, offset: 0x2db83): pxDummy6
    <977>   DW_AT_decl_file   : 9
    <978>   DW_AT_decl_line   : 1120
    <97a>   DW_AT_decl_column : 11
    <97b>   DW_AT_type        : <0x8d8>
    <97f>   DW_AT_data_member_location: 48
 <2><980>: Abbrev Number: 1 (DW_TAG_member)
    <981>   DW_AT_name        : (indirect string, offset: 0x4f1a4): ucDummy7
    <985>   DW_AT_decl_file   : 9
    <986>   DW_AT_decl_line   : 1121
    <988>   DW_AT_decl_column : 13
    <989>   DW_AT_type        : <0x9d7>
    <98d>   DW_AT_data_member_location: 52
 <2><98e>: Abbrev Number: 1 (DW_TAG_member)
    <98f>   DW_AT_name        : (indirect string, offset: 0x316a4): uxDummy12
    <993>   DW_AT_decl_file   : 9
    <994>   DW_AT_decl_line   : 1132
    <996>   DW_AT_decl_column : 16
    <997>   DW_AT_type        : <0x9e7>
    <99b>   DW_AT_data_member_location: 68
 <2><99c>: Abbrev Number: 1 (DW_TAG_member)
    <99d>   DW_AT_name        : (indirect string, offset: 0x20588): ulDummy18
    <9a1>   DW_AT_decl_file   : 9
    <9a2>   DW_AT_decl_line   : 1147
    <9a4>   DW_AT_decl_column : 14
    <9a5>   DW_AT_type        : <0x3b2>
    <9a9>   DW_AT_data_member_location: 76
 <2><9aa>: Abbrev Number: 1 (DW_TAG_member)
    <9ab>   DW_AT_name        : (indirect string, offset: 0x4468f): ucDummy19
    <9af>   DW_AT_decl_file   : 9
    <9b0>   DW_AT_decl_line   : 1148
    <9b2>   DW_AT_decl_column : 13
    <9b3>   DW_AT_type        : <0x395>
    <9b7>   DW_AT_data_member_location: 80
 <2><9b8>: Abbrev Number: 1 (DW_TAG_member)
    <9b9>   DW_AT_name        : (indirect string, offset: 0xcb70a): uxDummy20
    <9bd>   DW_AT_decl_file   : 9
    <9be>   DW_AT_decl_line   : 1151
    <9c0>   DW_AT_decl_column : 13
    <9c1>   DW_AT_type        : <0x395>
    <9c5>   DW_AT_data_member_location: 81
 <2><9c6>: Abbrev Number: 0
 <1><9c7>: Abbrev Number: 9 (DW_TAG_array_type)
    <9c8>   DW_AT_type        : <0x92d>
    <9cc>   DW_AT_sibling     : <0x9d7>
 <2><9d0>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <9d1>   DW_AT_type        : <0x38e>
    <9d5>   DW_AT_upper_bound : 1
 <2><9d6>: Abbrev Number: 0
 <1><9d7>: Abbrev Number: 9 (DW_TAG_array_type)
    <9d8>   DW_AT_type        : <0x395>
    <9dc>   DW_AT_sibling     : <0x9e7>
 <2><9e0>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <9e1>   DW_AT_type        : <0x38e>
    <9e5>   DW_AT_upper_bound : 15
 <2><9e6>: Abbrev Number: 0
 <1><9e7>: Abbrev Number: 9 (DW_TAG_array_type)
    <9e8>   DW_AT_type        : <0x8da>
    <9ec>   DW_AT_sibling     : <0x9f7>
 <2><9f0>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <9f1>   DW_AT_type        : <0x38e>
    <9f5>   DW_AT_upper_bound : 1
 <2><9f6>: Abbrev Number: 0
 <1><9f7>: Abbrev Number: 11 (DW_TAG_typedef)
    <9f8>   DW_AT_name        : (indirect string, offset: 0x6fe28): StaticTask_t
    <9fc>   DW_AT_decl_file   : 9
    <9fd>   DW_AT_decl_line   : 1160
    <9ff>   DW_AT_decl_column : 3
    <a00>   DW_AT_type        : <0x93a>
 <1><a04>: Abbrev Number: 4 (DW_TAG_typedef)
    <a05>   DW_AT_name        : (indirect string, offset: 0xc3b47): TaskHandle_t
    <a09>   DW_AT_decl_file   : 10
    <a0a>   DW_AT_decl_line   : 70
    <a0b>   DW_AT_decl_column : 37
    <a0c>   DW_AT_type        : <0xa10>
 <1><a10>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a11>   DW_AT_byte_size   : 4
    <a11>   DW_AT_type        : <0xa15>
 <1><a15>: Abbrev Number: 29 (DW_TAG_structure_type)
    <a16>   DW_AT_name        : (indirect string, offset: 0xe3e89): tskTaskControlBlock
    <a1a>   DW_AT_declaration : 1
 <1><a1a>: Abbrev Number: 6 (DW_TAG_base_type)
    <a1b>   DW_AT_byte_size   : 1
    <a1c>   DW_AT_encoding    : 8	(unsigned char)
    <a1d>   DW_AT_name        : (indirect string, offset: 0x4877f): char
 <1><a21>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <a22>   DW_AT_encoding    : 5	(signed)
    <a23>   DW_AT_byte_size   : 2
    <a24>   DW_AT_type        : <0x345>
    <a28>   DW_AT_decl_file   : 11
    <a29>   DW_AT_decl_line   : 172
    <a2a>   DW_AT_decl_column : 15
    <a2b>   DW_AT_sibling     : <0xa60>
 <2><a2f>: Abbrev Number: 18 (DW_TAG_enumerator)
    <a30>   DW_AT_name        : (indirect string, offset: 0xe3eca): osPriorityIdle
    <a34>   DW_AT_const_value : -3
 <2><a35>: Abbrev Number: 18 (DW_TAG_enumerator)
    <a36>   DW_AT_name        : (indirect string, offset: 0xe40f1): osPriorityLow
    <a3a>   DW_AT_const_value : -2
 <2><a3b>: Abbrev Number: 18 (DW_TAG_enumerator)
    <a3c>   DW_AT_name        : (indirect string, offset: 0xe4340): osPriorityBelowNormal
    <a40>   DW_AT_const_value : -1
 <2><a41>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a42>   DW_AT_name        : (indirect string, offset: 0xe3c62): osPriorityNormal
    <a46>   DW_AT_const_value : 0
 <2><a47>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a48>   DW_AT_name        : (indirect string, offset: 0xe368b): osPriorityAboveNormal
    <a4c>   DW_AT_const_value : 1
 <2><a4d>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a4e>   DW_AT_name        : (indirect string, offset: 0xe2c05): osPriorityHigh
    <a52>   DW_AT_const_value : 2
 <2><a53>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a54>   DW_AT_name        : (indirect string, offset: 0xe3fec): osPriorityRealtime
    <a58>   DW_AT_const_value : 3
 <2><a59>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a5a>   DW_AT_name        : (indirect string, offset: 0xe3ee1): osPriorityError
    <a5e>   DW_AT_const_value : 132
 <2><a5f>: Abbrev Number: 0
 <1><a60>: Abbrev Number: 4 (DW_TAG_typedef)
    <a61>   DW_AT_name        : (indirect string, offset: 0xe671b): osPriority
    <a65>   DW_AT_decl_file   : 11
    <a66>   DW_AT_decl_line   : 181
    <a67>   DW_AT_decl_column : 3
    <a68>   DW_AT_type        : <0xa21>
 <1><a6c>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <a6d>   DW_AT_encoding    : 7	(unsigned)
    <a6e>   DW_AT_byte_size   : 4
    <a6f>   DW_AT_type        : <0x38e>
    <a73>   DW_AT_decl_file   : 11
    <a74>   DW_AT_decl_line   : 189
    <a75>   DW_AT_decl_column : 15
    <a76>   DW_AT_sibling     : <0xad8>
 <2><a7a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a7b>   DW_AT_name        : (indirect string, offset: 0xe3a5d): osOK
    <a7f>   DW_AT_const_value : 0
 <2><a80>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a81>   DW_AT_name        : (indirect string, offset: 0xe3914): osEventSignal
    <a85>   DW_AT_const_value : 8
 <2><a86>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a87>   DW_AT_name        : (indirect string, offset: 0xe1d7b): osEventMessage
    <a8b>   DW_AT_const_value : 16
 <2><a8c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a8d>   DW_AT_name        : (indirect string, offset: 0xe367f): osEventMail
    <a91>   DW_AT_const_value : 32
 <2><a92>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a93>   DW_AT_name        : (indirect string, offset: 0xe2387): osEventTimeout
    <a97>   DW_AT_const_value : 64
 <2><a98>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a99>   DW_AT_name        : (indirect string, offset: 0xe274c): osErrorParameter
    <a9d>   DW_AT_const_value : 128
 <2><a9e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a9f>   DW_AT_name        : (indirect string, offset: 0xe3741): osErrorResource
    <aa3>   DW_AT_const_value : 129
 <2><aa4>: Abbrev Number: 3 (DW_TAG_enumerator)
    <aa5>   DW_AT_name        : (indirect string, offset: 0xe37a3): osErrorTimeoutResource
    <aa9>   DW_AT_const_value : 193
 <2><aaa>: Abbrev Number: 3 (DW_TAG_enumerator)
    <aab>   DW_AT_name        : (indirect string, offset: 0xe27dc): osErrorISR
    <aaf>   DW_AT_const_value : 130
 <2><ab0>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ab1>   DW_AT_name        : (indirect string, offset: 0xe22e4): osErrorISRRecursive
    <ab5>   DW_AT_const_value : 131
 <2><ab6>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ab7>   DW_AT_name        : (indirect string, offset: 0xe202b): osErrorPriority
    <abb>   DW_AT_const_value : 132
 <2><abc>: Abbrev Number: 3 (DW_TAG_enumerator)
    <abd>   DW_AT_name        : (indirect string, offset: 0xe2396): osErrorNoMemory
    <ac1>   DW_AT_const_value : 133
 <2><ac2>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ac3>   DW_AT_name        : (indirect string, offset: 0xe3890): osErrorValue
    <ac7>   DW_AT_const_value : 134
 <2><ac8>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ac9>   DW_AT_name        : (indirect string, offset: 0xe31aa): osErrorOS
    <acd>   DW_AT_const_value : 255
 <2><ace>: Abbrev Number: 30 (DW_TAG_enumerator)
    <acf>   DW_AT_name        : (indirect string, offset: 0xe2a1e): os_status_reserved
    <ad3>   DW_AT_const_value : 0x7fffffff
 <2><ad7>: Abbrev Number: 0
 <1><ad8>: Abbrev Number: 4 (DW_TAG_typedef)
    <ad9>   DW_AT_name        : (indirect string, offset: 0xe237e): osStatus
    <add>   DW_AT_decl_file   : 11
    <ade>   DW_AT_decl_line   : 205
    <adf>   DW_AT_decl_column : 3
    <ae0>   DW_AT_type        : <0xa6c>
 <1><ae4>: Abbrev Number: 4 (DW_TAG_typedef)
    <ae5>   DW_AT_name        : (indirect string, offset: 0xe303a): os_pthread
    <ae9>   DW_AT_decl_file   : 11
    <aea>   DW_AT_decl_line   : 228
    <aeb>   DW_AT_decl_column : 16
    <aec>   DW_AT_type        : <0xaf0>
 <1><af0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <af1>   DW_AT_byte_size   : 4
    <af1>   DW_AT_type        : <0xaf5>
 <1><af5>: Abbrev Number: 31 (DW_TAG_subroutine_type)
    <af6>   DW_AT_prototyped  : 1
    <af6>   DW_AT_sibling     : <0xb00>
 <2><afa>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <afb>   DW_AT_type        : <0xb00>
 <2><aff>: Abbrev Number: 0
 <1><b00>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b01>   DW_AT_byte_size   : 4
    <b01>   DW_AT_type        : <0xb05>
 <1><b05>: Abbrev Number: 32 (DW_TAG_const_type)
 <1><b06>: Abbrev Number: 4 (DW_TAG_typedef)
    <b07>   DW_AT_name        : (indirect string, offset: 0xe3674): osThreadId
    <b0b>   DW_AT_decl_file   : 11
    <b0c>   DW_AT_decl_line   : 238
    <b0d>   DW_AT_decl_column : 22
    <b0e>   DW_AT_type        : <0xa04>
 <1><b12>: Abbrev Number: 11 (DW_TAG_typedef)
    <b13>   DW_AT_name        : (indirect string, offset: 0xe35a9): osStaticThreadDef_t
    <b17>   DW_AT_decl_file   : 11
    <b18>   DW_AT_decl_line   : 267
    <b1a>   DW_AT_decl_column : 36
    <b1b>   DW_AT_type        : <0x9f7>
 <1><b1f>: Abbrev Number: 17 (DW_TAG_structure_type)
    <b20>   DW_AT_name        : (indirect string, offset: 0xe2535): os_thread_def
    <b24>   DW_AT_byte_size   : 28
    <b25>   DW_AT_decl_file   : 11
    <b26>   DW_AT_decl_line   : 280
    <b28>   DW_AT_decl_column : 16
    <b29>   DW_AT_sibling     : <0xb90>
 <2><b2d>: Abbrev Number: 1 (DW_TAG_member)
    <b2e>   DW_AT_name        : (indirect string, offset: 0xe3f29): name
    <b32>   DW_AT_decl_file   : 11
    <b33>   DW_AT_decl_line   : 281
    <b35>   DW_AT_decl_column : 27
    <b36>   DW_AT_type        : <0xb90>
    <b3a>   DW_AT_data_member_location: 0
 <2><b3b>: Abbrev Number: 1 (DW_TAG_member)
    <b3c>   DW_AT_name        : (indirect string, offset: 0xe303d): pthread
    <b40>   DW_AT_decl_file   : 11
    <b41>   DW_AT_decl_line   : 282
    <b43>   DW_AT_decl_column : 26
    <b44>   DW_AT_type        : <0xae4>
    <b48>   DW_AT_data_member_location: 4
 <2><b49>: Abbrev Number: 1 (DW_TAG_member)
    <b4a>   DW_AT_name        : (indirect string, offset: 0xe38c3): tpriority
    <b4e>   DW_AT_decl_file   : 11
    <b4f>   DW_AT_decl_line   : 283
    <b51>   DW_AT_decl_column : 26
    <b52>   DW_AT_type        : <0xa60>
    <b56>   DW_AT_data_member_location: 8
 <2><b57>: Abbrev Number: 1 (DW_TAG_member)
    <b58>   DW_AT_name        : (indirect string, offset: 0xe320d): instances
    <b5c>   DW_AT_decl_file   : 11
    <b5d>   DW_AT_decl_line   : 284
    <b5f>   DW_AT_decl_column : 26
    <b60>   DW_AT_type        : <0x3b2>
    <b64>   DW_AT_data_member_location: 12
 <2><b65>: Abbrev Number: 1 (DW_TAG_member)
    <b66>   DW_AT_name        : (indirect string, offset: 0xe2110): stacksize
    <b6a>   DW_AT_decl_file   : 11
    <b6b>   DW_AT_decl_line   : 285
    <b6d>   DW_AT_decl_column : 26
    <b6e>   DW_AT_type        : <0x3b2>
    <b72>   DW_AT_data_member_location: 16
 <2><b73>: Abbrev Number: 1 (DW_TAG_member)
    <b74>   DW_AT_name        : (indirect string, offset: 0xe2377): buffer
    <b78>   DW_AT_decl_file   : 11
    <b79>   DW_AT_decl_line   : 287
    <b7b>   DW_AT_decl_column : 27
    <b7c>   DW_AT_type        : <0xb95>
    <b80>   DW_AT_data_member_location: 20
 <2><b81>: Abbrev Number: 1 (DW_TAG_member)
    <b82>   DW_AT_name        : (indirect string, offset: 0xe2e08): controlblock
    <b86>   DW_AT_decl_file   : 11
    <b87>   DW_AT_decl_line   : 288
    <b89>   DW_AT_decl_column : 27
    <b8a>   DW_AT_type        : <0xb9a>
    <b8e>   DW_AT_data_member_location: 24
 <2><b8f>: Abbrev Number: 0
 <1><b90>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b91>   DW_AT_byte_size   : 4
    <b91>   DW_AT_type        : <0xa1a>
 <1><b95>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b96>   DW_AT_byte_size   : 4
    <b96>   DW_AT_type        : <0x3b2>
 <1><b9a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b9b>   DW_AT_byte_size   : 4
    <b9b>   DW_AT_type        : <0xb12>
 <1><b9f>: Abbrev Number: 11 (DW_TAG_typedef)
    <ba0>   DW_AT_name        : (indirect string, offset: 0xe2102): osThreadDef_t
    <ba4>   DW_AT_decl_file   : 11
    <ba5>   DW_AT_decl_line   : 290
    <ba7>   DW_AT_decl_column : 3
    <ba8>   DW_AT_type        : <0xb1f>
 <1><bac>: Abbrev Number: 14 (DW_TAG_const_type)
    <bad>   DW_AT_type        : <0xb9f>
 <1><bb1>: Abbrev Number: 33 (DW_TAG_variable)
    <bb2>   DW_AT_name        : (indirect string, offset: 0xe2c68): defaultTaskHandle
    <bb6>   DW_AT_decl_file   : 1
    <bb7>   DW_AT_decl_line   : 19
    <bb8>   DW_AT_decl_column : 12
    <bb9>   DW_AT_type        : <0xb06>
    <bbd>   DW_AT_external    : 1
    <bbd>   DW_AT_location    : 5 byte block: 3 80 2 0 20 	(DW_OP_addr: 20000280)
 <1><bc3>: Abbrev Number: 22 (DW_TAG_subprogram)
    <bc4>   DW_AT_external    : 1
    <bc4>   DW_AT_name        : (indirect string, offset: 0xe243d): HAL_GPIO_WritePin
    <bc8>   DW_AT_decl_file   : 7
    <bc8>   DW_AT_decl_line   : 296
    <bca>   DW_AT_decl_column : 19
    <bca>   DW_AT_prototyped  : 1
    <bca>   DW_AT_declaration : 1
    <bca>   DW_AT_sibling     : <0xbde>
 <2><bce>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <bcf>   DW_AT_type        : <0xbde>
 <2><bd3>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <bd4>   DW_AT_type        : <0x3a6>
 <2><bd8>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <bd9>   DW_AT_type        : <0x8a5>
 <2><bdd>: Abbrev Number: 0
 <1><bde>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <bdf>   DW_AT_byte_size   : 4
    <bdf>   DW_AT_type        : <0x473>
 <1><be3>: Abbrev Number: 22 (DW_TAG_subprogram)
    <be4>   DW_AT_external    : 1
    <be4>   DW_AT_name        : (indirect string, offset: 0xe3456): HAL_GPIO_Init
    <be8>   DW_AT_decl_file   : 7
    <be8>   DW_AT_decl_line   : 283
    <bea>   DW_AT_decl_column : 19
    <bea>   DW_AT_prototyped  : 1
    <bea>   DW_AT_declaration : 1
    <bea>   DW_AT_sibling     : <0xbf9>
 <2><bee>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <bef>   DW_AT_type        : <0xbde>
 <2><bf3>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <bf4>   DW_AT_type        : <0xbf9>
 <2><bf8>: Abbrev Number: 0
 <1><bf9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <bfa>   DW_AT_byte_size   : 4
    <bfa>   DW_AT_type        : <0x87e>
 <1><bfe>: Abbrev Number: 13 (DW_TAG_subprogram)
    <bff>   DW_AT_external    : 1
    <bff>   DW_AT_name        : (indirect string, offset: 0xe3e9d): HAL_RCC_ClockConfig
    <c03>   DW_AT_decl_file   : 6
    <c04>   DW_AT_decl_line   : 4837
    <c06>   DW_AT_decl_column : 19
    <c07>   DW_AT_prototyped  : 1
    <c07>   DW_AT_type        : <0x6d3>
    <c0b>   DW_AT_declaration : 1
    <c0b>   DW_AT_sibling     : <0xc1a>
 <2><c0f>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <c10>   DW_AT_type        : <0xc1a>
 <2><c14>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <c15>   DW_AT_type        : <0x3b2>
 <2><c19>: Abbrev Number: 0
 <1><c1a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <c1b>   DW_AT_byte_size   : 4
    <c1b>   DW_AT_type        : <0x833>
 <1><c1f>: Abbrev Number: 13 (DW_TAG_subprogram)
    <c20>   DW_AT_external    : 1
    <c20>   DW_AT_name        : (indirect string, offset: 0xe3791): HAL_RCC_OscConfig
    <c24>   DW_AT_decl_file   : 6
    <c25>   DW_AT_decl_line   : 4836
    <c27>   DW_AT_decl_column : 19
    <c28>   DW_AT_prototyped  : 1
    <c28>   DW_AT_type        : <0x6d3>
    <c2c>   DW_AT_declaration : 1
    <c2c>   DW_AT_sibling     : <0xc36>
 <2><c30>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <c31>   DW_AT_type        : <0xc36>
 <2><c35>: Abbrev Number: 0
 <1><c36>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <c37>   DW_AT_byte_size   : 4
    <c37>   DW_AT_type        : <0x7d6>
 <1><c3b>: Abbrev Number: 13 (DW_TAG_subprogram)
    <c3c>   DW_AT_external    : 1
    <c3c>   DW_AT_name        : (indirect string, offset: 0xe2c3f): HAL_PWREx_ControlVoltageScaling
    <c40>   DW_AT_decl_file   : 12
    <c41>   DW_AT_decl_line   : 837
    <c43>   DW_AT_decl_column : 19
    <c44>   DW_AT_prototyped  : 1
    <c44>   DW_AT_type        : <0x6d3>
    <c48>   DW_AT_declaration : 1
    <c48>   DW_AT_sibling     : <0xc52>
 <2><c4c>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <c4d>   DW_AT_type        : <0x3b2>
 <2><c51>: Abbrev Number: 0
 <1><c52>: Abbrev Number: 13 (DW_TAG_subprogram)
    <c53>   DW_AT_external    : 1
    <c53>   DW_AT_name        : (indirect string, offset: 0xe4512): osDelay
    <c57>   DW_AT_decl_file   : 11
    <c58>   DW_AT_decl_line   : 478
    <c5a>   DW_AT_decl_column : 10
    <c5b>   DW_AT_prototyped  : 1
    <c5b>   DW_AT_type        : <0xad8>
    <c5f>   DW_AT_declaration : 1
    <c5f>   DW_AT_sibling     : <0xc69>
 <2><c63>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <c64>   DW_AT_type        : <0x3b2>
 <2><c68>: Abbrev Number: 0
 <1><c69>: Abbrev Number: 23 (DW_TAG_subprogram)
    <c6a>   DW_AT_external    : 1
    <c6a>   DW_AT_name        : (indirect string, offset: 0xe2671): osKernelStart
    <c6e>   DW_AT_decl_file   : 11
    <c6f>   DW_AT_decl_line   : 374
    <c71>   DW_AT_decl_column : 10
    <c72>   DW_AT_prototyped  : 1
    <c72>   DW_AT_type        : <0xad8>
    <c76>   DW_AT_declaration : 1
 <1><c76>: Abbrev Number: 34 (DW_TAG_subprogram)
    <c77>   DW_AT_external    : 1
    <c77>   DW_AT_name        : (indirect string, offset: 0xb4f40): MX_FREERTOS_Init
    <c7b>   DW_AT_decl_file   : 1
    <c7c>   DW_AT_decl_line   : 32
    <c7d>   DW_AT_decl_column : 3
    <c7e>   DW_AT_type        : <0x387>
    <c82>   DW_AT_declaration : 1
    <c82>   DW_AT_sibling     : <0xc88>
 <2><c86>: Abbrev Number: 24 (DW_TAG_unspecified_parameters)
 <2><c87>: Abbrev Number: 0
 <1><c88>: Abbrev Number: 13 (DW_TAG_subprogram)
    <c89>   DW_AT_external    : 1
    <c89>   DW_AT_name        : (indirect string, offset: 0xe2c30): osThreadCreate
    <c8d>   DW_AT_decl_file   : 11
    <c8e>   DW_AT_decl_line   : 441
    <c90>   DW_AT_decl_column : 12
    <c91>   DW_AT_prototyped  : 1
    <c91>   DW_AT_type        : <0xb06>
    <c95>   DW_AT_declaration : 1
    <c95>   DW_AT_sibling     : <0xca4>
 <2><c99>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <c9a>   DW_AT_type        : <0xca4>
 <2><c9e>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <c9f>   DW_AT_type        : <0x8d8>
 <2><ca3>: Abbrev Number: 0
 <1><ca4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ca5>   DW_AT_byte_size   : 4
    <ca5>   DW_AT_type        : <0xbac>
 <1><ca9>: Abbrev Number: 23 (DW_TAG_subprogram)
    <caa>   DW_AT_external    : 1
    <caa>   DW_AT_name        : (indirect string, offset: 0xe414c): HAL_Init
    <cae>   DW_AT_decl_file   : 13
    <caf>   DW_AT_decl_line   : 636
    <cb1>   DW_AT_decl_column : 19
    <cb2>   DW_AT_prototyped  : 1
    <cb2>   DW_AT_type        : <0x6d3>
    <cb6>   DW_AT_declaration : 1
 <1><cb6>: Abbrev Number: 35 (DW_TAG_subprogram)
    <cb7>   DW_AT_name        : (indirect string, offset: 0xe3751): MX_GPIO_Init
    <cbb>   DW_AT_decl_file   : 1
    <cbc>   DW_AT_decl_line   : 79
    <cbd>   DW_AT_decl_column : 13
    <cbe>   DW_AT_prototyped  : 1
    <cbe>   DW_AT_low_pc      : 0x80002d4
    <cc2>   DW_AT_high_pc     : 0x60
    <cc6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <cc8>   DW_AT_call_all_tail_calls: 1
    <cc8>   DW_AT_sibling     : <0xcf5>
 <2><ccc>: Abbrev Number: 12 (DW_TAG_variable)
    <ccd>   DW_AT_name        : (indirect string, offset: 0xe3b9f): GPIO_InitStruct
    <cd1>   DW_AT_decl_file   : 1
    <cd2>   DW_AT_decl_line   : 81
    <cd3>   DW_AT_decl_column : 20
    <cd4>   DW_AT_type        : <0x87e>
    <cd8>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><cdb>: Abbrev Number: 36 (DW_TAG_lexical_block)
    <cdc>   DW_AT_low_pc      : 0x80002e8
    <ce0>   DW_AT_high_pc     : 0x18
 <3><ce4>: Abbrev Number: 12 (DW_TAG_variable)
    <ce5>   DW_AT_name        : (indirect string, offset: 0xe3c9c): tmpreg
    <ce9>   DW_AT_decl_file   : 1
    <cea>   DW_AT_decl_line   : 83
    <ceb>   DW_AT_decl_column : 3
    <cec>   DW_AT_type        : <0x3be>
    <cf0>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><cf3>: Abbrev Number: 0
 <2><cf4>: Abbrev Number: 0
 <1><cf5>: Abbrev Number: 25 (DW_TAG_subprogram)
    <cf6>   DW_AT_external    : 1
    <cf6>   DW_AT_name        : (indirect string, offset: 0xe3ef1): SystemClock_Config
    <cfa>   DW_AT_decl_file   : 1
    <cfa>   DW_AT_decl_line   : 53
    <cfb>   DW_AT_decl_column : 6
    <cfb>   DW_AT_prototyped  : 1
    <cfb>   DW_AT_low_pc      : 0x800026a
    <cff>   DW_AT_high_pc     : 0x6a
    <d03>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d05>   DW_AT_call_all_tail_calls: 1
    <d05>   DW_AT_sibling     : <0xd2a>
 <2><d09>: Abbrev Number: 12 (DW_TAG_variable)
    <d0a>   DW_AT_name        : (indirect string, offset: 0xe2607): RCC_OscInitStruct
    <d0e>   DW_AT_decl_file   : 1
    <d0f>   DW_AT_decl_line   : 55
    <d10>   DW_AT_decl_column : 22
    <d11>   DW_AT_type        : <0x7d6>
    <d15>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <2><d19>: Abbrev Number: 12 (DW_TAG_variable)
    <d1a>   DW_AT_name        : (indirect string, offset: 0xe2c1e): RCC_ClkInitStruct
    <d1e>   DW_AT_decl_file   : 1
    <d1f>   DW_AT_decl_line   : 56
    <d20>   DW_AT_decl_column : 22
    <d21>   DW_AT_type        : <0x827>
    <d25>   DW_AT_location    : 3 byte block: 91 a0 7f 	(DW_OP_fbreg: -96)
 <2><d29>: Abbrev Number: 0
 <1><d2a>: Abbrev Number: 25 (DW_TAG_subprogram)
    <d2b>   DW_AT_external    : 1
    <d2b>   DW_AT_name        : (indirect string, offset: 0xe2660): StartDefaultTask
    <d2f>   DW_AT_decl_file   : 1
    <d2f>   DW_AT_decl_line   : 44
    <d30>   DW_AT_decl_column : 6
    <d30>   DW_AT_prototyped  : 1
    <d30>   DW_AT_low_pc      : 0x8000258
    <d34>   DW_AT_high_pc     : 0x12
    <d38>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d3a>   DW_AT_call_all_tail_calls: 1
    <d3a>   DW_AT_sibling     : <0xd4e>
 <2><d3e>: Abbrev Number: 37 (DW_TAG_formal_parameter)
    <d3f>   DW_AT_name        : (indirect string, offset: 0xe25fe): argument
    <d43>   DW_AT_decl_file   : 1
    <d44>   DW_AT_decl_line   : 44
    <d45>   DW_AT_decl_column : 36
    <d46>   DW_AT_type        : <0xb00>
    <d4a>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><d4d>: Abbrev Number: 0
 <1><d4e>: Abbrev Number: 38 (DW_TAG_subprogram)
    <d4f>   DW_AT_external    : 1
    <d4f>   DW_AT_name        : (indirect string, offset: 0xe21e5): main
    <d53>   DW_AT_decl_file   : 1
    <d54>   DW_AT_decl_line   : 21
    <d55>   DW_AT_decl_column : 5
    <d56>   DW_AT_prototyped  : 1
    <d56>   DW_AT_type        : <0x387>
    <d5a>   DW_AT_low_pc      : 0x8000210
    <d5e>   DW_AT_high_pc     : 0x48
    <d62>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d64>   DW_AT_call_all_tail_calls: 1
 <2><d64>: Abbrev Number: 12 (DW_TAG_variable)
    <d65>   DW_AT_name        : (indirect string, offset: 0xe3922): os_thread_def_defaultTask
    <d69>   DW_AT_decl_file   : 1
    <d6a>   DW_AT_decl_line   : 28
    <d6b>   DW_AT_decl_column : 3
    <d6c>   DW_AT_type        : <0xbac>
    <d70>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><d73>: Abbrev Number: 39 (DW_TAG_subprogram)
    <d74>   DW_AT_external    : 1
    <d74>   DW_AT_name        : (indirect string, offset: 0xb4f40): MX_FREERTOS_Init
    <d78>   DW_AT_decl_file   : 1
    <d79>   DW_AT_decl_line   : 32
    <d7a>   DW_AT_decl_column : 3
    <d7b>   DW_AT_type        : <0x387>
    <d7f>   DW_AT_declaration : 1
 <3><d7f>: Abbrev Number: 24 (DW_TAG_unspecified_parameters)
 <3><d80>: Abbrev Number: 0
 <2><d81>: Abbrev Number: 0
 <1><d82>: Abbrev Number: 0
  Compilation Unit @ offset 0xd83:
   Length:        0x551 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x377
   Pointer Size:  4
 <0><d8f>: Abbrev Number: 10 (DW_TAG_compile_unit)
    <d90>   DW_AT_producer    : (indirect string, offset: 0xdd5df): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <d94>   DW_AT_language    : 29	(C11)
    <d95>   DW_AT_name        : (indirect string, offset: 0xe48d3): D:/Projeto-WR/Rastreador_WR/Core/Src/stm32l4xx_hal_msp.c
    <d99>   DW_AT_comp_dir    : (indirect string, offset: 0xa3403): D:/Projeto-WR/Rastreador_WR/STM32CubeIDE/Debug
    <d9d>   DW_AT_ranges      : 0x50
    <da1>   DW_AT_low_pc      : 0
    <da5>   DW_AT_stmt_list   : 0x11da
    <da9>   DW_AT_macros      : 0x2473d
 <1><dad>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <dae>   DW_AT_encoding    : 5	(signed)
    <daf>   DW_AT_byte_size   : 1
    <db0>   DW_AT_type        : <0xfd8>
    <db4>   DW_AT_decl_file   : 2
    <db5>   DW_AT_decl_line   : 66
    <db6>   DW_AT_decl_column : 1
    <db7>   DW_AT_sibling     : <0xfd8>
 <2><dbb>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dbc>   DW_AT_name        : (indirect string, offset: 0xe4645): NonMaskableInt_IRQn
    <dc0>   DW_AT_const_value : -14
 <2><dc1>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc2>   DW_AT_name        : (indirect string, offset: 0xe4887): HardFault_IRQn
    <dc6>   DW_AT_const_value : -13
 <2><dc7>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc8>   DW_AT_name        : (indirect string, offset: 0xe4684): MemoryManagement_IRQn
    <dcc>   DW_AT_const_value : -12
 <2><dcd>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dce>   DW_AT_name        : (indirect string, offset: 0xe492f): BusFault_IRQn
    <dd2>   DW_AT_const_value : -11
 <2><dd3>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dd4>   DW_AT_name        : (indirect string, offset: 0xe485f): UsageFault_IRQn
    <dd8>   DW_AT_const_value : -10
 <2><dd9>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dda>   DW_AT_name        : (indirect string, offset: 0xe45ca): SVCall_IRQn
    <dde>   DW_AT_const_value : -5
 <2><ddf>: Abbrev Number: 4 (DW_TAG_enumerator)
    <de0>   DW_AT_name        : (indirect string, offset: 0xe47b1): DebugMonitor_IRQn
    <de4>   DW_AT_const_value : -4
 <2><de5>: Abbrev Number: 4 (DW_TAG_enumerator)
    <de6>   DW_AT_name        : (indirect string, offset: 0xe47f8): PendSV_IRQn
    <dea>   DW_AT_const_value : -2
 <2><deb>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dec>   DW_AT_name        : (indirect string, offset: 0xe495d): SysTick_IRQn
    <df0>   DW_AT_const_value : -1
 <2><df1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <df2>   DW_AT_name        : (indirect string, offset: 0xe487d): WWDG_IRQn
    <df6>   DW_AT_const_value : 0
 <2><df7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <df8>   DW_AT_name        : (indirect string, offset: 0xe49fc): PVD_PVM_IRQn
    <dfc>   DW_AT_const_value : 1
 <2><dfd>: Abbrev Number: 1 (DW_TAG_enumerator)
    <dfe>   DW_AT_name        : (indirect string, offset: 0xe4a3c): TAMP_STAMP_IRQn
    <e02>   DW_AT_const_value : 2
 <2><e03>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e04>   DW_AT_name        : (indirect string, offset: 0xe4837): RTC_WKUP_IRQn
    <e08>   DW_AT_const_value : 3
 <2><e09>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e0a>   DW_AT_name        : (indirect string, offset: 0xe46a8): FLASH_IRQn
    <e0e>   DW_AT_const_value : 4
 <2><e0f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e10>   DW_AT_name        : (indirect string, offset: 0xe4a09): RCC_IRQn
    <e14>   DW_AT_const_value : 5
 <2><e15>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e16>   DW_AT_name        : (indirect string, offset: 0xe47c3): EXTI0_IRQn
    <e1a>   DW_AT_const_value : 6
 <2><e1b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e1c>   DW_AT_name        : (indirect string, offset: 0xe4a25): EXTI1_IRQn
    <e20>   DW_AT_const_value : 7
 <2><e21>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e22>   DW_AT_name        : (indirect string, offset: 0xe476f): EXTI2_IRQn
    <e26>   DW_AT_const_value : 8
 <2><e27>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e28>   DW_AT_name        : (indirect string, offset: 0xe496a): EXTI3_IRQn
    <e2c>   DW_AT_const_value : 9
 <2><e2d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e2e>   DW_AT_name        : (indirect string, offset: 0xe4679): EXTI4_IRQn
    <e32>   DW_AT_const_value : 10
 <2><e33>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e34>   DW_AT_name        : (indirect string, offset: 0xe470a): DMA1_Channel1_IRQn
    <e38>   DW_AT_const_value : 11
 <2><e39>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e3a>   DW_AT_name        : (indirect string, offset: 0xe48c0): DMA1_Channel2_IRQn
    <e3e>   DW_AT_const_value : 12
 <2><e3f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e40>   DW_AT_name        : (indirect string, offset: 0xe4629): DMA1_Channel3_IRQn
    <e44>   DW_AT_const_value : 13
 <2><e45>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e46>   DW_AT_name        : (indirect string, offset: 0xe4824): DMA1_Channel4_IRQn
    <e4a>   DW_AT_const_value : 14
 <2><e4b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e4c>   DW_AT_name        : (indirect string, offset: 0xe45e0): DMA1_Channel5_IRQn
    <e50>   DW_AT_const_value : 15
 <2><e51>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e52>   DW_AT_name        : (indirect string, offset: 0xe4791): DMA1_Channel6_IRQn
    <e56>   DW_AT_const_value : 16
 <2><e57>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e58>   DW_AT_name        : (indirect string, offset: 0xe49cf): DMA1_Channel7_IRQn
    <e5c>   DW_AT_const_value : 17
 <2><e5d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e5e>   DW_AT_name        : (indirect string, offset: 0x77f68): ADC1_2_IRQn
    <e62>   DW_AT_const_value : 18
 <2><e63>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e64>   DW_AT_name        : (indirect string, offset: 0xe49ef): CAN1_TX_IRQn
    <e68>   DW_AT_const_value : 19
 <2><e69>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e6a>   DW_AT_name        : (indirect string, offset: 0xe469a): CAN1_RX0_IRQn
    <e6e>   DW_AT_const_value : 20
 <2><e6f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e70>   DW_AT_name        : (indirect string, offset: 0xe486f): CAN1_RX1_IRQn
    <e74>   DW_AT_const_value : 21
 <2><e75>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e76>   DW_AT_name        : (indirect string, offset: 0xe46bf): CAN1_SCE_IRQn
    <e7a>   DW_AT_const_value : 22
 <2><e7b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e7c>   DW_AT_name        : (indirect string, offset: 0xe49e2): EXTI9_5_IRQn
    <e80>   DW_AT_const_value : 23
 <2><e81>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e82>   DW_AT_name        : (indirect string, offset: 0xe493d): TIM1_BRK_TIM15_IRQn
    <e86>   DW_AT_const_value : 24
 <2><e87>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e88>   DW_AT_name        : (indirect string, offset: 0xe46e4): TIM1_UP_TIM16_IRQn
    <e8c>   DW_AT_const_value : 25
 <2><e8d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e8e>   DW_AT_name        : (indirect string, offset: 0x1609): TIM1_TRG_COM_TIM17_IRQn
    <e92>   DW_AT_const_value : 26
 <2><e93>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e94>   DW_AT_name        : (indirect string, offset: 0xe47a4): TIM1_CC_IRQn
    <e98>   DW_AT_const_value : 27
 <2><e99>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e9a>   DW_AT_name        : (indirect string, offset: 0xe46b5): TIM2_IRQn
    <e9e>   DW_AT_const_value : 28
 <2><e9f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ea0>   DW_AT_name        : (indirect string, offset: 0xe480e): TIM3_IRQn
    <ea4>   DW_AT_const_value : 29
 <2><ea5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ea6>   DW_AT_name        : (indirect string, offset: 0xe45d6): TIM4_IRQn
    <eaa>   DW_AT_const_value : 30
 <2><eab>: Abbrev Number: 1 (DW_TAG_enumerator)
    <eac>   DW_AT_name        : (indirect string, offset: 0xe472f): I2C1_EV_IRQn
    <eb0>   DW_AT_const_value : 31
 <2><eb1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <eb2>   DW_AT_name        : (indirect string, offset: 0xe4845): I2C1_ER_IRQn
    <eb6>   DW_AT_const_value : 32
 <2><eb7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <eb8>   DW_AT_name        : (indirect string, offset: 0xe477a): I2C2_EV_IRQn
    <ebc>   DW_AT_const_value : 33
 <2><ebd>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ebe>   DW_AT_name        : (indirect string, offset: 0xe4745): I2C2_ER_IRQn
    <ec2>   DW_AT_const_value : 34
 <2><ec3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ec4>   DW_AT_name        : (indirect string, offset: 0xe461f): SPI1_IRQn
    <ec8>   DW_AT_const_value : 35
 <2><ec9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <eca>   DW_AT_name        : (indirect string, offset: 0xe4804): SPI2_IRQn
    <ece>   DW_AT_const_value : 36
 <2><ecf>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ed0>   DW_AT_name        : (indirect string, offset: 0xe4951): USART1_IRQn
    <ed4>   DW_AT_const_value : 37
 <2><ed5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ed6>   DW_AT_name        : (indirect string, offset: 0xe46cd): USART2_IRQn
    <eda>   DW_AT_const_value : 38
 <2><edb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <edc>   DW_AT_name        : (indirect string, offset: 0xe48a1): USART3_IRQn
    <ee0>   DW_AT_const_value : 39
 <2><ee1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ee2>   DW_AT_name        : (indirect string, offset: 0xe498a): EXTI15_10_IRQn
    <ee6>   DW_AT_const_value : 40
 <2><ee7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ee8>   DW_AT_name        : (indirect string, offset: 0xe4999): RTC_Alarm_IRQn
    <eec>   DW_AT_const_value : 41
 <2><eed>: Abbrev Number: 1 (DW_TAG_enumerator)
    <eee>   DW_AT_name        : (indirect string, offset: 0xf503): DFSDM1_FLT3_IRQn
    <ef2>   DW_AT_const_value : 42
 <2><ef3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ef4>   DW_AT_name        : (indirect string, offset: 0xe45ff): TIM8_BRK_IRQn
    <ef8>   DW_AT_const_value : 43
 <2><ef9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <efa>   DW_AT_name        : (indirect string, offset: 0x2fd2): TIM8_UP_IRQn
    <efe>   DW_AT_const_value : 44
 <2><eff>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f00>   DW_AT_name        : (indirect string, offset: 0xe460d): TIM8_TRG_COM_IRQn
    <f04>   DW_AT_const_value : 45
 <2><f05>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f06>   DW_AT_name        : (indirect string, offset: 0xe4916): TIM8_CC_IRQn
    <f0a>   DW_AT_const_value : 46
 <2><f0b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f0c>   DW_AT_name        : (indirect string, offset: 0xe490c): ADC3_IRQn
    <f10>   DW_AT_const_value : 47
 <2><f11>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f12>   DW_AT_name        : (indirect string, offset: 0xe463c): FMC_IRQn
    <f16>   DW_AT_const_value : 48
 <2><f17>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f18>   DW_AT_name        : (indirect string, offset: 0xc1037): SDMMC1_IRQn
    <f1c>   DW_AT_const_value : 49
 <2><f1d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f1e>   DW_AT_name        : (indirect string, offset: 0xe4787): TIM5_IRQn
    <f22>   DW_AT_const_value : 50
 <2><f23>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f24>   DW_AT_name        : (indirect string, offset: 0xe4a59): SPI3_IRQn
    <f28>   DW_AT_const_value : 51
 <2><f29>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f2a>   DW_AT_name        : (indirect string, offset: 0xe4896): UART4_IRQn
    <f2e>   DW_AT_const_value : 52
 <2><f2f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f30>   DW_AT_name        : (indirect string, offset: 0xe46d9): UART5_IRQn
    <f34>   DW_AT_const_value : 53
 <2><f35>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f36>   DW_AT_name        : (indirect string, offset: 0x5b463): TIM6_DAC_IRQn
    <f3a>   DW_AT_const_value : 54
 <2><f3b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f3c>   DW_AT_name        : (indirect string, offset: 0xe47db): TIM7_IRQn
    <f40>   DW_AT_const_value : 55
 <2><f41>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f42>   DW_AT_name        : (indirect string, offset: 0xe47e5): DMA2_Channel1_IRQn
    <f46>   DW_AT_const_value : 56
 <2><f47>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f48>   DW_AT_name        : (indirect string, offset: 0xe4a12): DMA2_Channel2_IRQn
    <f4c>   DW_AT_const_value : 57
 <2><f4d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f4e>   DW_AT_name        : (indirect string, offset: 0xe4752): DMA2_Channel3_IRQn
    <f52>   DW_AT_const_value : 58
 <2><f53>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f54>   DW_AT_name        : (indirect string, offset: 0xe49a8): DMA2_Channel4_IRQn
    <f58>   DW_AT_const_value : 59
 <2><f59>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f5a>   DW_AT_name        : (indirect string, offset: 0xe46f7): DMA2_Channel5_IRQn
    <f5e>   DW_AT_const_value : 60
 <2><f5f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f60>   DW_AT_name        : (indirect string, offset: 0x829f9): DFSDM1_FLT0_IRQn
    <f64>   DW_AT_const_value : 61
 <2><f65>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f66>   DW_AT_name        : (indirect string, offset: 0xa8cf1): DFSDM1_FLT1_IRQn
    <f6a>   DW_AT_const_value : 62
 <2><f6b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f6c>   DW_AT_name        : (indirect string, offset: 0x572ae): DFSDM1_FLT2_IRQn
    <f70>   DW_AT_const_value : 63
 <2><f71>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f72>   DW_AT_name        : (indirect string, offset: 0xe4a63): COMP_IRQn
    <f76>   DW_AT_const_value : 64
 <2><f77>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f78>   DW_AT_name        : (indirect string, offset: 0xe4923): LPTIM1_IRQn
    <f7c>   DW_AT_const_value : 65
 <2><f7d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f7e>   DW_AT_name        : (indirect string, offset: 0xe46b3): LPTIM2_IRQn
    <f82>   DW_AT_const_value : 66
 <2><f83>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f84>   DW_AT_name        : (indirect string, offset: 0xe4818): OTG_FS_IRQn
    <f88>   DW_AT_const_value : 67
 <2><f89>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f8a>   DW_AT_name        : (indirect string, offset: 0xe48ad): DMA2_Channel6_IRQn
    <f8e>   DW_AT_const_value : 68
 <2><f8f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f90>   DW_AT_name        : (indirect string, offset: 0xe4659): DMA2_Channel7_IRQn
    <f94>   DW_AT_const_value : 69
 <2><f95>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f96>   DW_AT_name        : (indirect string, offset: 0xe4852): LPUART1_IRQn
    <f9a>   DW_AT_const_value : 70
 <2><f9b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f9c>   DW_AT_name        : (indirect string, offset: 0xe47ce): QUADSPI_IRQn
    <fa0>   DW_AT_const_value : 71
 <2><fa1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fa2>   DW_AT_name        : (indirect string, offset: 0xe4a4c): I2C3_EV_IRQn
    <fa6>   DW_AT_const_value : 72
 <2><fa7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fa8>   DW_AT_name        : (indirect string, offset: 0xe466c): I2C3_ER_IRQn
    <fac>   DW_AT_const_value : 73
 <2><fad>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fae>   DW_AT_name        : (indirect string, offset: 0xe4765): SAI1_IRQn
    <fb2>   DW_AT_const_value : 74
 <2><fb3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fb4>   DW_AT_name        : (indirect string, offset: 0xe49bb): SAI2_IRQn
    <fb8>   DW_AT_const_value : 75
 <2><fb9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fba>   DW_AT_name        : (indirect string, offset: 0xe4a30): SWPMI1_IRQn
    <fbe>   DW_AT_const_value : 76
 <2><fbf>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fc0>   DW_AT_name        : (indirect string, offset: 0xe473c): TSC_IRQn
    <fc4>   DW_AT_const_value : 77
 <2><fc5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fc6>   DW_AT_name        : (indirect string, offset: 0xe471d): LCD_IRQn
    <fca>   DW_AT_const_value : 78
 <2><fcb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fcc>   DW_AT_name        : (indirect string, offset: 0xa323f): RNG_IRQn
    <fd0>   DW_AT_const_value : 80
 <2><fd1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fd2>   DW_AT_name        : (indirect string, offset: 0xe4726): FPU_IRQn
    <fd6>   DW_AT_const_value : 81
 <2><fd7>: Abbrev Number: 0
 <1><fd8>: Abbrev Number: 3 (DW_TAG_base_type)
    <fd9>   DW_AT_byte_size   : 1
    <fda>   DW_AT_encoding    : 6	(signed char)
    <fdb>   DW_AT_name        : (indirect string, offset: 0x71a3e): signed char
 <1><fdf>: Abbrev Number: 5 (DW_TAG_typedef)
    <fe0>   DW_AT_name        : (indirect string, offset: 0xe49c5): IRQn_Type
    <fe4>   DW_AT_decl_file   : 2
    <fe5>   DW_AT_decl_line   : 159
    <fe6>   DW_AT_decl_column : 3
    <fe7>   DW_AT_type        : <0xdad>
 <1><feb>: Abbrev Number: 5 (DW_TAG_typedef)
    <fec>   DW_AT_name        : (indirect string, offset: 0x41568): __uint8_t
    <ff0>   DW_AT_decl_file   : 3
    <ff1>   DW_AT_decl_line   : 43
    <ff2>   DW_AT_decl_column : 24
    <ff3>   DW_AT_type        : <0xff7>
 <1><ff7>: Abbrev Number: 3 (DW_TAG_base_type)
    <ff8>   DW_AT_byte_size   : 1
    <ff9>   DW_AT_encoding    : 8	(unsigned char)
    <ffa>   DW_AT_name        : (indirect string, offset: 0xd95a4): unsigned char
 <1><ffe>: Abbrev Number: 3 (DW_TAG_base_type)
    <fff>   DW_AT_byte_size   : 2
    <1000>   DW_AT_encoding    : 5	(signed)
    <1001>   DW_AT_name        : (indirect string, offset: 0xa6ff7): short int
 <1><1005>: Abbrev Number: 3 (DW_TAG_base_type)
    <1006>   DW_AT_byte_size   : 2
    <1007>   DW_AT_encoding    : 7	(unsigned)
    <1008>   DW_AT_name        : (indirect string, offset: 0xd7cca): short unsigned int
 <1><100c>: Abbrev Number: 3 (DW_TAG_base_type)
    <100d>   DW_AT_byte_size   : 4
    <100e>   DW_AT_encoding    : 5	(signed)
    <100f>   DW_AT_name        : (indirect string, offset: 0x12e56): long int
 <1><1013>: Abbrev Number: 5 (DW_TAG_typedef)
    <1014>   DW_AT_name        : (indirect string, offset: 0x8f8a3): __uint32_t
    <1018>   DW_AT_decl_file   : 3
    <1019>   DW_AT_decl_line   : 79
    <101a>   DW_AT_decl_column : 25
    <101b>   DW_AT_type        : <0x101f>
 <1><101f>: Abbrev Number: 3 (DW_TAG_base_type)
    <1020>   DW_AT_byte_size   : 4
    <1021>   DW_AT_encoding    : 7	(unsigned)
    <1022>   DW_AT_name        : (indirect string, offset: 0x557a7): long unsigned int
 <1><1026>: Abbrev Number: 3 (DW_TAG_base_type)
    <1027>   DW_AT_byte_size   : 8
    <1028>   DW_AT_encoding    : 5	(signed)
    <1029>   DW_AT_name        : (indirect string, offset: 0x666fa): long long int
 <1><102d>: Abbrev Number: 3 (DW_TAG_base_type)
    <102e>   DW_AT_byte_size   : 8
    <102f>   DW_AT_encoding    : 7	(unsigned)
    <1030>   DW_AT_name        : (indirect string, offset: 0x2ea30): long long unsigned int
 <1><1034>: Abbrev Number: 12 (DW_TAG_base_type)
    <1035>   DW_AT_byte_size   : 4
    <1036>   DW_AT_encoding    : 5	(signed)
    <1037>   DW_AT_name        : int
 <1><103b>: Abbrev Number: 3 (DW_TAG_base_type)
    <103c>   DW_AT_byte_size   : 4
    <103d>   DW_AT_encoding    : 7	(unsigned)
